20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.org
:properties:
:ID: 20231128T074518
:end:
#+title:      KDOC 59: ECSを使ってサンプルゲームを作る
#+date:       [2023-11-28 Tue 07:45]
#+filetags:   :project:
#+identifier: 20231128T074518

[[id:dc45bd7d-b8c4-47ef-ae84-c548f81c50bb][EntityComponentSystem]]を使って、サンプルゲームを作る。

#+caption: ゲーム
#+BEGIN_EXPORT html
<iframe width="560" height="315" src="https://kijimad.github.io/ruins/"></iframe>
#+END_EXPORT

実際のゲーム画面。ウィンドウにフォーカスして方向キーで操作できる。

- リポジトリ。[[https://github.com/kijimaD/ruins][kijimaD/ruins]]

* 方針
まずストーリー抜きで、RPGとしてゲームが成立するようにする。

最低限の要素。

1. クリア画面
2. 階層移動
3. 敵とのエンカウント
4. バトル

* 素材
よさげな素材をリンクしておく。

- https://www.pixilart.com/art/mayon-sr21881399e91aws3
  - 火山の背景
* Tasks
** TODO フィールドに敵シンボルを作る
:LOGBOOK:
CLOCK: [2024-09-03 Tue 21:51]--[2024-09-03 Tue 22:16] =>  0:25
CLOCK: [2024-09-03 Tue 21:12]--[2024-09-03 Tue 21:37] =>  0:25
CLOCK: [2024-09-03 Tue 00:25]--[2024-09-03 Tue 00:50] =>  0:25
CLOCK: [2024-09-02 Mon 23:46]--[2024-09-03 Tue 00:11] =>  0:25
CLOCK: [2024-09-02 Mon 23:12]--[2024-09-02 Mon 23:37] =>  0:25
CLOCK: [2024-09-02 Mon 22:46]--[2024-09-02 Mon 23:11] =>  0:25
CLOCK: [2024-09-01 Sun 23:33]--[2024-09-01 Sun 23:58] =>  0:25
CLOCK: [2024-09-01 Sun 22:39]--[2024-09-01 Sun 23:04] =>  0:25
CLOCK: [2024-09-01 Sun 21:14]--[2024-09-01 Sun 21:39] =>  0:25
CLOCK: [2024-09-01 Sun 20:49]--[2024-09-01 Sun 21:14] =>  0:25
CLOCK: [2024-09-01 Sun 20:19]--[2024-09-01 Sun 20:44] =>  0:25
:END:

- とりあえず動かないやつ
- ランダムに動くやつ
- 向きによる画像をどうするか
  - 自キャラは8方向にしか動かないが、敵キャラはそうではない
  - 角度の範囲にすればいいか
  - 今は回転だが、回転は見た目があまりよくない
  - 画像を5方向分用意して切り替えがよさそう(反転させて全方向にする)
  - とりあえず回転はなくしておく
- かぶる問題
  - positionを指定したはいいけど、重複検知がやりにくいな
  - tileだったら全体管理できていて楽だけど...
  - スポーンのとき限定で、スポーン済みタイル配列を持っておいてチェックするとか
  - スポーン時はタイルで判断できれば問題ない。スポーン時、すべてのエンティティがタイルに沿った位置にある
  - タイルを指定してスポーンするインターフェースにすればよいのでは

** TODO クリアできるようにする
:PROPERTIES:
:Effort:   5:00
:END:
:LOGBOOK:
CLOCK: [2024-06-02 Sun 11:26]--[2024-06-02 Sun 11:51] =>  0:25
CLOCK: [2024-06-02 Sun 10:57]--[2024-06-02 Sun 11:22] =>  0:25
CLOCK: [2024-06-01 Sat 19:49]--[2024-06-01 Sat 20:14] =>  0:25
:END:

とりあえずクリアできるようにする。

- 20Fにいくとボス部屋になる
- 最終階層では脱出するか、ボスと戦う
- 将来的には、階層の異なる複数の遺跡があるが、とりあえずは1つの遺跡だけでよい
- 最終階層にあるイベントパッドに触れるとクリア

** TODO 階層移動をEffectでやる
:LOGBOOK:
CLOCK: [2024-06-02 Sun 22:09]--[2024-06-02 Sun 22:34] =>  0:25
CLOCK: [2024-06-02 Sun 21:44]--[2024-06-02 Sun 22:09] =>  0:25
CLOCK: [2024-06-02 Sun 16:14]--[2024-06-02 Sun 16:39] =>  0:25
CLOCK: [2024-06-02 Sun 13:44]--[2024-06-02 Sun 14:09] =>  0:25
:END:
階層移動をイベントとして、ほかの箇所で使いやすくする。

- 特定のenitityを対象としないeffectだけど、これでいいのかな。参考コードの状況とは異なる。特定のentityではなく、gameResourceを変更する。ただ、アイテムで階層移動とかもしたいので、effectでできればいいか
- 今の階層移動の仕組み、わかりづらいな

** TODO 接触でイベント発火させる
:LOGBOOK:
CLOCK: [2024-06-02 Sun 21:17]--[2024-06-02 Sun 21:42] =>  0:25
CLOCK: [2024-06-02 Sun 17:56]--[2024-06-02 Sun 18:21] =>  0:25
CLOCK: [2024-06-02 Sun 17:28]--[2024-06-02 Sun 17:53] =>  0:25
CLOCK: [2024-06-02 Sun 16:56]--[2024-06-02 Sun 17:21] =>  0:25
:END:

- 接触したときに、テキストをいくつか表示したあとに、クリアにして、メインメニューに戻す
- テキスト表示と、ステート遷移

#+caption: 疑似コード
#+begin_src go
  winEvent()

  func finishEvent() {
          msg(`
  <bg='treasure'>
  黒く輝く珠を発見した。
  <bg='black'>
  願いを叶え、幸せに暮らした。
  `)
          switch(MainMenuState)
  }

  # 将来的
  # ボスとの戦闘
  func bossEvent() {
          events := []eventFunc{
                  msg(`
  美しい庭園が広がっている。中心には鏡のような水面を湛えた池がある。ほかの階層より気温が低い。雰囲気が変わったので、ここが最下層だろう。
  庭園の中心に浮かぶ島には、青白い炎に囲まれた、ローブを着た骸骨が待ち受けている。
  `),
                  battle('Elder Witch'),
                  msg('宝を入手した'),
                  flag(TowerFinish),
          }
          submit(events, HomeMenuState)
  }

  # フィールドでの汎用イベント
  func itemEvent() {
          msg(`何か落ちているぞ`)
          getRandomItem()
          pop(DungeonState)
  }
#+end_src

- フィールドでの戦闘勝利後はフィールドに戻ってほしい
- イベントでの戦闘勝利後は後続のイベントを開始してほしい
- イベント進行ステートを作ればいいかな。会話終了時や戦闘終了時はpopしてもらってイベント進行ステートに戻る。前の続きから開始する
- フラグ管理とかアイテム入手とかあるから、コード形式なのが望ましい
- どうやって戻ってきて再開するか。キューをポップしてから実行してやればいいのかな。実行したものは消えて、戻ると新しいイベントを実行して遷移する、という

#+begin_src shell
  func (s State) Update() {
      event := s.Queue.Pop()
      event() # 遷移が実行される。キューにない場合は、ステートを終了する
  }
#+end_src

** TODO raycastを高速化する
- もっとも近い壁を記憶することで、高速化できるという
- https://www.redblobgames.com/articles/visibility/#wall-tracking
** TODO 視覚影でスプライトが隠れているのを直す
近くのライトで見られるようにしたが、微妙だ。

- 壁の向こう側が見える
  - 対策のため1マス分だけ照らすようにしたが、変だ
- やはり、直接視界が当たった部分はフラグをもたせて表示するのがよさそう
  - 個別のタイルごとにあるので、新しくコンポーネントを作ったほうがよさそう
  - ~IsHide~ とか
- ここに時間かけてもしょうがないから後回しか

** TODO 汎用の選択コンテナを作成する
:LOGBOOK:
CLOCK: [2024-04-21 Sun 23:10]--[2024-04-21 Sun 23:35] =>  0:25
CLOCK: [2024-04-21 Sun 21:20]--[2024-04-21 Sun 21:45] =>  0:25
CLOCK: [2024-04-20 Sat 16:44]--[2024-04-20 Sat 17:09] =>  0:25
CLOCK: [2024-04-20 Sat 15:41]--[2024-04-20 Sat 16:06] =>  0:25
CLOCK: [2024-04-20 Sat 15:15]--[2024-04-20 Sat 15:40] =>  0:25
CLOCK: [2024-04-20 Sat 14:50]--[2024-04-20 Sat 15:15] =>  0:25
CLOCK: [2024-04-20 Sat 14:25]--[2024-04-20 Sat 14:50] =>  0:25
CLOCK: [2024-04-20 Sat 12:46]--[2024-04-20 Sat 13:11] =>  0:25
CLOCK: [2024-04-20 Sat 11:30]--[2024-04-20 Sat 11:55] =>  0:25
:END:
メニューなど、なにかを一覧して選択するのは多く使うので、作っておきたい。

メニュー。

- 選択肢のリスト
- 現在選択中の番号を示す変数

ゲージ。

- HP
- レベル
- 名前

どうやればいいのだろうか。

- 構造体で作っておいて、後で代入できるようにしとくといいのでは。あとその構造体に親子関係を作るメソッドを作ると。

#+begin_src go
  type aa struct {
          root ui.Container
          desc ui.Container
          list ui.Container
  }

  func (aa *aa) assemble {
          aa.root.AddChild(aa.desc)
          aa.root.AddChild(aa.list)
  }
#+end_src

** TODO リアルタイムなローグライクがよさそう
:LOGBOOK:
CLOCK: [2024-04-23 Tue 00:49]--[2024-04-23 Tue 01:14] =>  0:25
:END:
- フィールドは[[https://ebitengine.org/en/examples/raycasting.html][Ray Casting - Ebitengine]]という感じ
- タイルごとにターン制で動くという感じでない。細かく移動できる
- 自分が動いたら時間が進行する
- シンボルエンカウントで、回避する方法がある。煙幕的な
- 電力と燃料がある
  - 電力は短期的なスタミナ。フィールドでダッシュ、煙幕、掘削で減る。有利に進められるが、時間での制限がある
  - 燃料は、腹減り度。電力を使うと早く消費する。なくなるとゲームオーバーになる。移動で減る
** TODO 合成のレアリティスコア
性能にスコアをつけ、結果的に出来上がったものに対してレアリティランクをつけるとよさそう。
** TODO イベント部分の設計
:LOGBOOK:
CLOCK: [2024-01-04 Thu 09:56]--[2024-01-04 Thu 10:21] =>  0:25
CLOCK: [2024-01-03 Wed 22:35]--[2024-01-03 Wed 23:00] =>  0:25
CLOCK: [2024-01-03 Wed 21:52]--[2024-01-03 Wed 22:17] =>  0:25
CLOCK: [2024-01-03 Wed 21:09]--[2024-01-03 Wed 21:34] =>  0:25
CLOCK: [2024-01-03 Wed 19:12]--[2024-01-03 Wed 19:37] =>  0:25
:END:
1章のうろつきをどうするか考える。

- ローグライト形式にすると物語に関してあまり考えなくてよい
  - 繰り返しのゲームプレイに変化をつけやすい
  - 設定とかが伝わりにくい可能性がある
  - Tipsという形式でオプショナルに読めればよさそう
  - Tipsだと自然に紹介できなさそうな感じもする
  - あまり物語性はない
  - 物語部分は背景やSEつきのメッセージ形式で良い
- 行けるところはランダムで選ばれた4つにする
  - 行った回数によってイベントが起こる
  - 背反なイベントがある
  - 回数を重ねることで仲間になったりアイテムがもらえたりする
    - 例
    - 市場 x 2 => 整備士が仲間になる
    - 広場 x 2 => 回復薬がもらえる
  - 単調な感じもする
- イベントによって仲間になったり、アイテムが増えたり、ステータスが変動したりする

