20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-09-08 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 59: ECSを使ってサンプルゲームを作る</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 59: ECSを使ってサンプルゲームを作る</h1>
<p>
<a href="20230930175757-entitycomponentsystem.html#ID-dc45bd7d-b8c4-47ef-ae84-c548f81c50bb">EntityComponentSystem</a>を使って、サンプルゲームを作る。
</p>

<iframe width="560" height="315" src="https://kijimad.github.io/ruins/"></iframe>

<p>
実際のゲーム画面。ウィンドウにフォーカスして方向キーで操作できる。
</p>

<ul class="org-ul">
<li>リポジトリ。<a href="https://github.com/kijimaD/ruins">kijimaD/ruins</a></li>
</ul>

<div id="outline-container-orgb90a0b4" class="outline-2">
<h2 id="orgb90a0b4"><a href="#orgb90a0b4">方針</a></h2>
<div class="outline-text-2" id="text-orgb90a0b4">
<p>
まずストーリー抜きで、RPGとしてゲームが成立するようにする。
</p>

<p>
最低限の要素。
</p>

<ol class="org-ol">
<li>クリア画面</li>
<li>階層移動</li>
<li>敵とのエンカウント</li>
<li>バトル</li>
</ol>
</div>
</div>

<div id="outline-container-orge380b09" class="outline-2">
<h2 id="orge380b09"><a href="#orge380b09">素材</a></h2>
<div class="outline-text-2" id="text-orge380b09">
<p>
よさげな素材をリンクしておく。
</p>

<ul class="org-ul">
<li><a href="https://www.pixilart.com/art/mayon-sr21881399e91aws3">https://www.pixilart.com/art/mayon-sr21881399e91aws3</a>
<ul class="org-ul">
<li>火山の背景</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0eab99e" class="outline-2">
<h2 id="org0eab99e"><a href="#org0eab99e">Tasks</a></h2>
<div class="outline-text-2" id="text-org0eab99e">
</div>
<div id="outline-container-org069667a" class="outline-3">
<h3 id="org069667a"><a href="#org069667a"><span class="todo TODO">TODO</span> フィールドに敵シンボルを作る</a></h3>
<div class="outline-text-3" id="text-org069667a">
<ul class="org-ul">
<li>とりあえず動かないやつ</li>
<li>ランダムに動くやつ</li>
<li>向きによる画像をどうするか
<ul class="org-ul">
<li>自キャラは8方向にしか動かないが、敵キャラはそうではない</li>
<li>角度の範囲にすればいいか</li>
<li>今は回転だが、回転は見た目があまりよくない</li>
<li>画像を5方向分用意して切り替えがよさそう(反転させて全方向にする)</li>
<li>とりあえず回転はなくしておく</li>
</ul></li>
<li>かぶる問題
<ul class="org-ul">
<li>positionを指定したはいいけど、重複検知がやりにくいな</li>
<li>tileだったら全体管理できていて楽だけど&#x2026;</li>
<li>スポーンのとき限定で、スポーン済みタイル配列を持っておいてチェックするとか</li>
<li>スポーン時はタイルで判断できれば問題ない。スポーン時、すべてのエンティティがタイルに沿った位置にある</li>
<li>タイルを指定してスポーンするインターフェースにすればよいのでは</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7e0a270" class="outline-3">
<h3 id="org7e0a270"><a href="#org7e0a270"><span class="todo TODO">TODO</span> クリアできるようにする</a></h3>
<div class="outline-text-3" id="text-org7e0a270">
<p>
とりあえずクリアできるようにする。
</p>

<ul class="org-ul">
<li>20Fにいくとボス部屋になる</li>
<li>最終階層では脱出するか、ボスと戦う</li>
<li>将来的には、階層の異なる複数の遺跡があるが、とりあえずは1つの遺跡だけでよい</li>
<li>最終階層にあるイベントパッドに触れるとクリア</li>
</ul>
</div>
</div>

<div id="outline-container-orgbab6ccf" class="outline-3">
<h3 id="orgbab6ccf"><a href="#orgbab6ccf"><span class="todo TODO">TODO</span> 階層移動をEffectでやる</a></h3>
<div class="outline-text-3" id="text-orgbab6ccf">
<p>
階層移動をイベントとして、ほかの箇所で使いやすくする。
</p>

<ul class="org-ul">
<li>特定のenitityを対象としないeffectだけど、これでいいのかな。参考コードの状況とは異なる。特定のentityではなく、gameResourceを変更する。ただ、アイテムで階層移動とかもしたいので、effectでできればいいか</li>
<li>今の階層移動の仕組み、わかりづらいな</li>
</ul>
</div>
</div>

<div id="outline-container-orgee35a0a" class="outline-3">
<h3 id="orgee35a0a"><a href="#orgee35a0a"><span class="todo TODO">TODO</span> 接触でイベント発火させる</a></h3>
<div class="outline-text-3" id="text-orgee35a0a">
<ul class="org-ul">
<li>接触したときに、テキストをいくつか表示したあとに、クリアにして、メインメニューに戻す</li>
<li>テキスト表示と、ステート遷移</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>疑似コード</label><pre class="src src-go">winEvent()

func finishEvent() {
        msg(`
&lt;bg='treasure'&gt;
黒く輝く珠を発見した。
&lt;bg='black'&gt;
願いを叶え、幸せに暮らした。
`)
        switch(MainMenuState)
}

# 将来的
# ボスとの戦闘
func bossEvent() {
        events := []eventFunc{
                msg(`
美しい庭園が広がっている。中心には鏡のような水面を湛えた池がある。ほかの階層より気温が低い。雰囲気が変わったので、ここが最下層だろう。
庭園の中心に浮かぶ島には、青白い炎に囲まれた、ローブを着た骸骨が待ち受けている。
`),
                battle('Elder Witch'),
                msg('宝を入手した'),
                flag(TowerFinish),
        }
        submit(events, HomeMenuState)
}

# フィールドでの汎用イベント
func itemEvent() {
        msg(`何か落ちているぞ`)
        getRandomItem()
        pop(DungeonState)
}
</pre>
</div>

<ul class="org-ul">
<li>フィールドでの戦闘勝利後はフィールドに戻ってほしい</li>
<li>イベントでの戦闘勝利後は後続のイベントを開始してほしい</li>
<li>イベント進行ステートを作ればいいかな。会話終了時や戦闘終了時はpopしてもらってイベント進行ステートに戻る。前の続きから開始する</li>
<li>フラグ管理とかアイテム入手とかあるから、コード形式なのが望ましい</li>
<li>どうやって戻ってきて再開するか。キューをポップしてから実行してやればいいのかな。実行したものは消えて、戻ると新しいイベントを実行して遷移する、という</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-function-name">func</span> (s State) Update() {
    event := s.Queue.Pop()
    event() <span class="org-comment-delimiter"># </span><span class="org-comment">&#36983;&#31227;&#12364;&#23455;&#34892;&#12373;&#12428;&#12427;&#12290;&#12461;&#12517;&#12540;&#12395;&#12394;&#12356;&#22580;&#21512;&#12399;&#12289;&#12473;&#12486;&#12540;&#12488;&#12434;&#32066;&#20102;&#12377;&#12427;</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1bcea99" class="outline-3">
<h3 id="org1bcea99"><a href="#org1bcea99"><span class="todo TODO">TODO</span> raycastを高速化する</a></h3>
<div class="outline-text-3" id="text-org1bcea99">
<ul class="org-ul">
<li>もっとも近い壁を記憶することで、高速化できるという</li>
<li><a href="https://www.redblobgames.com/articles/visibility/#wall-tracking">https://www.redblobgames.com/articles/visibility/#wall-tracking</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9a9e67b" class="outline-3">
<h3 id="org9a9e67b"><a href="#org9a9e67b"><span class="todo TODO">TODO</span> 視覚影でスプライトが隠れているのを直す</a></h3>
<div class="outline-text-3" id="text-org9a9e67b">
<p>
近くのライトで見られるようにしたが、微妙だ。
</p>

<ul class="org-ul">
<li>壁の向こう側が見える
<ul class="org-ul">
<li>対策のため1マス分だけ照らすようにしたが、変だ</li>
</ul></li>
<li>やはり、直接視界が当たった部分はフラグをもたせて表示するのがよさそう
<ul class="org-ul">
<li>個別のタイルごとにあるので、新しくコンポーネントを作ったほうがよさそう</li>
<li><code>IsHide</code> とか</li>
</ul></li>
<li>ここに時間かけてもしょうがないから後回しか</li>
</ul>
</div>
</div>

<div id="outline-container-org81a512b" class="outline-3">
<h3 id="org81a512b"><a href="#org81a512b"><span class="todo TODO">TODO</span> 汎用の選択コンテナを作成する</a></h3>
<div class="outline-text-3" id="text-org81a512b">
<p>
メニューなど、なにかを一覧して選択するのは多く使うので、作っておきたい。
</p>

<p>
メニュー。
</p>

<ul class="org-ul">
<li>選択肢のリスト</li>
<li>現在選択中の番号を示す変数</li>
</ul>

<p>
ゲージ。
</p>

<ul class="org-ul">
<li>HP</li>
<li>レベル</li>
<li>名前</li>
</ul>

<p>
どうやればいいのだろうか。
</p>

<ul class="org-ul">
<li>構造体で作っておいて、後で代入できるようにしとくといいのでは。あとその構造体に親子関係を作るメソッドを作ると。</li>
</ul>

<div class="org-src-container">
<pre class="src src-go">type aa struct {
        root ui.Container
        desc ui.Container
        list ui.Container
}

func (aa *aa) assemble {
        aa.root.AddChild(aa.desc)
        aa.root.AddChild(aa.list)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org687d682" class="outline-3">
<h3 id="org687d682"><a href="#org687d682"><span class="todo TODO">TODO</span> リアルタイムなローグライクがよさそう</a></h3>
<div class="outline-text-3" id="text-org687d682">
<ul class="org-ul">
<li>フィールドは<a href="https://ebitengine.org/en/examples/raycasting.html">Ray Casting - Ebitengine</a>という感じ</li>
<li>タイルごとにターン制で動くという感じでない。細かく移動できる</li>
<li>自分が動いたら時間が進行する</li>
<li>シンボルエンカウントで、回避する方法がある。煙幕的な</li>
<li>電力と燃料がある
<ul class="org-ul">
<li>電力は短期的なスタミナ。フィールドでダッシュ、煙幕、掘削で減る。有利に進められるが、時間での制限がある</li>
<li>燃料は、腹減り度。電力を使うと早く消費する。なくなるとゲームオーバーになる。移動で減る</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf0e4cdc" class="outline-3">
<h3 id="orgf0e4cdc"><a href="#orgf0e4cdc"><span class="todo TODO">TODO</span> 合成のレアリティスコア</a></h3>
<div class="outline-text-3" id="text-orgf0e4cdc">
<p>
性能にスコアをつけ、結果的に出来上がったものに対してレアリティランクをつけるとよさそう。
</p>
</div>
</div>
<div id="outline-container-orge279b72" class="outline-3">
<h3 id="orge279b72"><a href="#orge279b72"><span class="todo TODO">TODO</span> イベント部分の設計</a></h3>
<div class="outline-text-3" id="text-orge279b72">
<p>
1章のうろつきをどうするか考える。
</p>

<ul class="org-ul">
<li>ローグライト形式にすると物語に関してあまり考えなくてよい
<ul class="org-ul">
<li>繰り返しのゲームプレイに変化をつけやすい</li>
<li>設定とかが伝わりにくい可能性がある</li>
<li>Tipsという形式でオプショナルに読めればよさそう</li>
<li>Tipsだと自然に紹介できなさそうな感じもする</li>
<li>あまり物語性はない</li>
<li>物語部分は背景やSEつきのメッセージ形式で良い</li>
</ul></li>
<li>行けるところはランダムで選ばれた4つにする
<ul class="org-ul">
<li>行った回数によってイベントが起こる</li>
<li>背反なイベントがある</li>
<li>回数を重ねることで仲間になったりアイテムがもらえたりする
<ul class="org-ul">
<li>例</li>
<li>市場 x 2 =&gt; 整備士が仲間になる</li>
<li>広場 x 2 =&gt; 回復薬がもらえる</li>
</ul></li>
<li>単調な感じもする</li>
</ul></li>
<li>イベントによって仲間になったり、アイテムが増えたり、ステータスが変動したりする</li>
</ul>
</div>
</div>
