20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.html

<div id="outline-container-org51ba12f" class="outline-3">
<h3 id="org51ba12f"><a href="#org51ba12f"><span class="todo TODO">TODO</span> アイテム使用・削除をsystem化する</a></h3>
<div class="outline-text-3" id="text-org51ba12f">
<p>
wantsToUseエンティティを生成して、そのエンティティをsystemでキャッチする。
</p>

<p>
直接削除すると共通処理が追加しにくかったりする。
</p>

<p>
共通の関数化するだけでよさそうな感じもする。実行順とかがややこしくなるのかな。メッセージを伝える用のエンティティをいちいち作るのが面倒なんだよな。コードも増える。ポリシーを考えなければ。
</p>
</div>
</div>

<div id="outline-container-org0764ce3" class="outline-3">
<h3 id="org0764ce3"><a href="#org0764ce3"><span class="todo TODO">TODO</span> モジュール分けする</a></h3>
<div class="outline-text-3" id="text-org0764ce3">
<p>
名前がかぶってややこしいものは分ける。
</p>

<ul class="org-ul">
<li>system</li>
<li>app</li>
<li>message engine</li>
</ul>
</div>
</div>
<div id="outline-container-orgbe4929b" class="outline-3">
<h3 id="orgbe4929b"><a href="#orgbe4929b"><span class="todo TODO">TODO</span> 味方一覧表示を共通化する</a></h3>
<div class="outline-text-3" id="text-orgbe4929b">
<p>
いろんなところで使いそうかつ、複数のパーツで構成されているので作成が面倒なので。
</p>
</div>
</div>

<div id="outline-container-org123de27" class="outline-3">
<h3 id="org123de27"><a href="#org123de27"><span class="todo TODO">TODO</span> ステート切り替えが怪しい部分がある</a></h3>
<div class="outline-text-3" id="text-org123de27">
<p>
特にpopしている部分。
</p>

<ul class="org-ul">
<li>pushで、文字があると重なる</li>
<li>popしたときにOnStartは走らないので、前の画面を削除するのはダメ</li>
</ul>
</div>
</div>

<div id="outline-container-org7ea35b8" class="outline-3">
<h3 id="org7ea35b8"><a href="#org7ea35b8"><span class="todo TODO">TODO</span> 図形 or 画像描画の方法を考える</a></h3>
<div class="outline-text-3" id="text-org7ea35b8">
<p>
UIのために図形描画したい。どうするか。画像を用意すればよいが、いい感じにやるためにはどうすればいいか。
</p>
</div>
</div>

<div id="outline-container-org93f55ea" class="outline-3">
<h3 id="org93f55ea"><a href="#org93f55ea"><span class="todo TODO">TODO</span> 生成をランダム化する</a></h3>
<div class="outline-text-3" id="text-org93f55ea">
<p>
ある程度ランダム化したい。プレイヤー、モンスター、ワープゲートの出る位置をバラけさせる。
</p>
</div>
</div>

<div id="outline-container-orgde1beee" class="outline-3">
<h3 id="orgde1beee"><a href="#orgde1beee"><span class="todo TODO">TODO</span> 未探索の暗闇を追加する</a></h3>
<div class="outline-text-3" id="text-orgde1beee">
<p>
未探検の部分は暗くなる。
</p>
</div>
</div>

<div id="outline-container-orgeeb5826" class="outline-3">
<h3 id="orgeeb5826"><a href="#orgeeb5826"><span class="todo TODO">TODO</span> 照明を追加する</a></h3>
<div class="outline-text-3" id="text-orgeeb5826">
<p>
照明がある部分は色が変わる。
</p>
</div>
</div>

<div id="outline-container-org0b3c53b" class="outline-3">
<h3 id="org0b3c53b"><a href="#org0b3c53b"><span class="todo TODO">TODO</span> タイルの種類を増やす</a></h3>
<div class="outline-text-3" id="text-org0b3c53b">
<p>
見た目がよくないので、2種類の通常フロアを用意する。
</p>

<p>
ステージ作成が少し面倒になるか。2種類のタイルの違いをファイルに書き出したくないな。勝手に判断して入れてくれるのが一番良い。壁が隣接してたら〜とか。
</p>
</div>
</div>

<div id="outline-container-org5320ddd" class="outline-3">
<h3 id="org5320ddd"><a href="#org5320ddd"><span class="todo TODO">TODO</span> ゲームループカウントをグローバル化する</a></h3>
<div class="outline-text-3" id="text-org5320ddd">
<p>
数えてメッセージのアニメーションさせる用。汎用的なのでグローバルでやってよさそう。アニメーションのためのもっとよい方法がある可能性はある。ちゃんと調べないとな…。
</p>
</div>
</div>

<div id="outline-container-orge000817" class="outline-3">
<h3 id="orge000817"><a href="#orge000817"><span class="todo TODO">TODO</span> アニメーションのやり方を考える</a></h3>
<div class="outline-text-3" id="text-orge000817">
<p>
どうやっているのだろう。
</p>
</div>
</div>
<div id="outline-container-orgd36fb6e" class="outline-3">
<h3 id="orgd36fb6e"><a href="#orgd36fb6e"><span class="todo TODO">TODO</span> メッセージシステムのパッケージを切り出す</a></h3>
<div class="outline-text-3" id="text-orgd36fb6e">
<p>
今は1パッケージに入っていてわかりにくい。
</p>
</div>
</div>
</div>
<div id="outline-container-org909129c" class="outline-2">
<h2 id="org909129c"><a href="#org909129c">考察</a></h2>
<div class="outline-text-2" id="text-org909129c">
<ul class="org-ul">
<li>作った</li>
<li>しかし、発表に値するような事柄はない</li>
<li>技術的な挑戦的な部分は一切ない。新しいことをやっているわけでもない</li>
<li>参考にして面白かったことはある
<ul class="org-ul">
<li>ECS - コンポーネントで考える</li>
<li>ゲームにはさまざなデータがあるが、確実にファイル化する。ソースコードに入れない</li>
</ul></li>
<li>ひとつある</li>
<li>個人のゲーム開発の99%は途中で挫折する(自分比)</li>
<li>工夫
<ul class="org-ul">
<li>意図的にやらないことを選択した</li>
<li>グラフィック、アニメーション、音楽は捨てた</li>
<li>常にプレイできる状態を保った</li>
<li>とりあえずクリアできるようにして、人に見せた</li>
</ul></li>
</ul>

<p>
工夫。
</p>

<ul class="org-ul">
<li>データを別にしている。ファイルからパラメータを調整できる</li>
<li>ECS(Entity Component System)</li>
</ul>
</div>
</div>

<div id="outline-container-orgc097075" class="outline-2">
<h2 id="orgc097075"><a href="#orgc097075">Archives</a></h2>
<div class="outline-text-2" id="text-orgc097075">
</div>
<div id="outline-container-org6072c7a" class="outline-3">
<h3 id="org6072c7a"><a href="#org6072c7a"><span class="done DONE">DONE</span> メッセージ表示できるようにする</a></h3>
<div class="outline-text-3" id="text-org6072c7a">
<p>
<a href="https://github.com/x-hgg-x/sokoban-go">x-hgg-x/sokoban-go</a>を使って小さいサンプルを作る。
</p>
</div>
</div>
<div id="outline-container-org37d90b5" class="outline-3">
<h3 id="org37d90b5"><a href="#org37d90b5"><span class="done DONE">DONE</span> メッセージシステムのリファクタ</a></h3>
<div class="outline-text-3" id="text-org37d90b5">
<p>
使いにくいので直す。
</p>
</div>
</div>
<div id="outline-container-orgcb5c34d" class="outline-3">
<h3 id="orgcb5c34d"><a href="#orgcb5c34d"><span class="done DONE">DONE</span> メッセージシステムに自動改行を入れる</a></h3>
<div class="outline-text-3" id="text-orgcb5c34d">
<p>
飛び出すのを防ぐ。
</p>
</div>
</div>
<div id="outline-container-orga4d8e6e" class="outline-3">
<h3 id="orga4d8e6e"><a href="#orga4d8e6e"><span class="done DONE">DONE</span> ファイルを埋め込む</a></h3>
<div class="outline-text-3" id="text-orga4d8e6e">
<p>
デプロイで扱いやすいように。
</p>
</div>
</div>

<div id="outline-container-org5a307a1" class="outline-3">
<h3 id="org5a307a1"><a href="#org5a307a1"><span class="done DONE">DONE</span> CI設定</a></h3>
<div class="outline-text-3" id="text-org5a307a1">
<p>
テストとビルドとデプロイする。
</p>

<p>
デプロイしたけど、ブラウザで表示できてないな。
</p>
</div>
</div>
<div id="outline-container-org11586b8" class="outline-3">
<h3 id="org11586b8"><a href="#org11586b8"><span class="done DONE">DONE</span> フィールドで動けるようにする</a></h3>
<div class="outline-text-3" id="text-org11586b8">
<ul class="org-ul">
<li>テキストで地図を読み込む</li>
<li>コンポーネントを作る</li>
<li>地図を表示する</li>
<li>移動できるようにする</li>
</ul>

<p>
実行時エラーになる。表示できない。インターフェースが取り出せないよう。
</p>

<ul class="org-ul">
<li>コンポーネントの初期化を忘れていた</li>
<li>LoadLevel()によって読み込んだComponentListをAddEntities()-&gt;AddEntityComponent()に渡す。が、AddEntitiesで失敗する。テキストで読み込んだ内容をreflectでオブジェクト化するときに、新しく作成したコンポーネントを初期化するのに失敗している</li>
<li>ecsComponentListを調べてみよう
<ul class="org-ul">
<li>ecvでGameが入ってない</li>
<li>world.Components.Game</li>
</ul></li>
<li>sokoban-go では main.goのw.InitWorld(&amp;gc.Components{})の時点でworld.Components.Gameがセットされている</li>
</ul>
</div>
</div>
<div id="outline-container-orgfeab844" class="outline-3">
<h3 id="orgfeab844"><a href="#orgfeab844"><span class="done DONE">DONE</span> マップを表示できるようにする</a></h3>
<div class="outline-text-3" id="text-orgfeab844">
<p>
表示する。
</p>
</div>
</div>
