20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.org
** DONE 階数を移動できるようにする
CLOSED: [2023-12-03 Sun 14:41]
:LOGBOOK:
CLOCK: [2023-12-03 Sun 14:13]--[2023-12-03 Sun 14:38] =>  0:25
CLOCK: [2023-12-03 Sun 13:35]--[2023-12-03 Sun 14:00] =>  0:25
CLOCK: [2023-12-03 Sun 12:19]--[2023-12-03 Sun 12:44] =>  0:25
CLOCK: [2023-12-03 Sun 11:33]--[2023-12-03 Sun 11:58] =>  0:25
CLOCK: [2023-12-03 Sun 11:08]--[2023-12-03 Sun 11:33] =>  0:25
CLOCK: [2023-12-03 Sun 10:43]--[2023-12-03 Sun 11:08] =>  0:25
:END:
1階からはじまって、次の階層に移動する。

ワープホール。
** DONE クロスコンパイルする
CLOSED: [2023-12-03 Sun 15:45]
:LOGBOOK:
CLOCK: [2023-12-03 Sun 15:19]--[2023-12-03 Sun 15:44] =>  0:25
:END:
一応CIに設定して保証しておく。
** DONE メッセージが飛び出すのを直す
CLOSED: [2023-12-03 Sun 17:50]
ステート遷移イベントを作る。
** DONE 次の階をランダムに選択する
CLOSED: [2023-12-03 Sun 18:14]
:LOGBOOK:
CLOCK: [2023-12-03 Sun 16:57]--[2023-12-03 Sun 17:22] =>  0:25
CLOCK: [2023-12-03 Sun 16:26]--[2023-12-03 Sun 16:51] =>  0:25
CLOCK: [2023-12-03 Sun 15:51]--[2023-12-03 Sun 16:16] =>  0:25
CLOCK: [2023-12-03 Sun 14:41]--[2023-12-03 Sun 15:06] =>  0:25
:END:
一覧からランダムに選択する。
** DONE HomeStateを作成する
CLOSED: [2023-12-04 Mon 20:44]
:LOGBOOK:
CLOCK: [2023-12-04 Mon 08:48]--[2023-12-04 Mon 09:13] =>  0:25
CLOCK: [2023-12-04 Mon 00:44]--[2023-12-04 Mon 01:09] =>  0:25
CLOCK: [2023-12-03 Sun 19:51]--[2023-12-03 Sun 20:16] =>  0:25
:END:
ゲームプレイの基軸になるメニュー。
** DONE 脱出できるようにする
CLOSED: [2023-12-04 Mon 20:45]
:LOGBOOK:
CLOCK: [2023-12-03 Sun 17:51]--[2023-12-03 Sun 18:16] =>  0:25
:END:
脱出階層で脱出できるようにする。
** DONE 背景を設定する
CLOSED: [2023-12-05 Tue 00:46]
:LOGBOOK:
CLOCK: [2023-12-04 Mon 22:24]--[2023-12-04 Mon 22:49] =>  0:25
CLOCK: [2023-12-04 Mon 21:59]--[2023-12-04 Mon 22:24] =>  0:25
CLOCK: [2023-12-04 Mon 21:34]--[2023-12-04 Mon 21:59] =>  0:25
:END:
背景を追加する。スプライトはあるけど、同じでいいのか。いや、スプライトは1枚の画像を分割するものだから、同じ感じでは扱えないな。変えるとsystemも変えないといけない。面倒なのでとりあえずいいか。
** DONE サブメニュー追加
CLOSED: [2023-12-07 Thu 00:31]
:LOGBOOK:
CLOCK: [2023-12-07 Thu 00:05]--[2023-12-07 Thu 00:30] =>  0:25
CLOCK: [2023-12-06 Wed 23:25]--[2023-12-06 Wed 23:50] =>  0:25
CLOCK: [2023-12-06 Wed 22:32]--[2023-12-06 Wed 22:57] =>  0:25
CLOCK: [2023-12-06 Wed 22:07]--[2023-12-06 Wed 22:32] =>  0:25
CLOCK: [2023-12-06 Wed 00:38]--[2023-12-06 Wed 01:03] =>  0:25
CLOCK: [2023-12-05 Tue 00:47]--[2023-12-05 Tue 01:12] =>  0:25
CLOCK: [2023-12-04 Mon 20:46]--[2023-12-04 Mon 21:11] =>  0:25
:END:
拠点メニューにはサブメニューがある。どうやるか考える。

- 別stateでやる
  - 大量にstateができるのどうなのという感じ。背景コンポーネントとかも同じ感じで準備しないといけない
- リファレンスではどうやっているのだろう。ポーズでは、後ろを透明に表示しつつ、メニューを表示している。あれと同じようなことができないか
  - ポーズメニューでは、OnStopでポーズメニューのエンティティのみを削除しているようだ。ほかのstateでは、すべてのエンティティを削除することが異なる
** DONE pauseステート作成
CLOSED: [2023-12-07 Thu 08:30]
:LOGBOOK:
CLOCK: [2023-12-07 Thu 08:05]--[2023-12-07 Thu 08:30] =>  0:25
CLOCK: [2023-12-07 Thu 00:31]--[2023-12-07 Thu 00:56] =>  0:25
:END:

デバッグで便利なので。
** DONE アイテムを生成する
CLOSED: [2023-12-10 Sun 11:16]
:LOGBOOK:
CLOCK: [2023-12-10 Sun 00:44]--[2023-12-10 Sun 01:09] =>  0:25
CLOCK: [2023-12-10 Sun 00:11]--[2023-12-10 Sun 00:36] =>  0:25
CLOCK: [2023-12-09 Sat 23:40]--[2023-12-10 Sun 00:05] =>  0:25
CLOCK: [2023-12-09 Sat 22:34]--[2023-12-09 Sat 22:59] =>  0:25
CLOCK: [2023-12-09 Sat 22:08]--[2023-12-09 Sat 22:33] =>  0:25
CLOCK: [2023-12-09 Sat 21:20]--[2023-12-09 Sat 21:45] =>  0:25
CLOCK: [2023-12-09 Sat 20:54]--[2023-12-09 Sat 21:19] =>  0:25
CLOCK: [2023-12-09 Sat 17:34]--[2023-12-09 Sat 17:59] =>  0:25
CLOCK: [2023-12-09 Sat 17:09]--[2023-12-09 Sat 17:34] =>  0:25
CLOCK: [2023-12-09 Sat 16:44]--[2023-12-09 Sat 17:09] =>  0:25
CLOCK: [2023-12-09 Sat 12:08]--[2023-12-09 Sat 12:33] =>  0:25
CLOCK: [2023-12-09 Sat 11:39]--[2023-12-09 Sat 12:04] =>  0:25
CLOCK: [2023-12-09 Sat 10:56]--[2023-12-09 Sat 11:21] =>  0:25
CLOCK: [2023-12-09 Sat 10:28]--[2023-12-09 Sat 10:53] =>  0:25
CLOCK: [2023-12-09 Sat 09:58]--[2023-12-09 Sat 10:23] =>  0:25
CLOCK: [2023-12-08 Fri 00:54]--[2023-12-08 Fri 01:19] =>  0:25
CLOCK: [2023-12-08 Fri 00:09]--[2023-12-08 Fri 00:34] =>  0:25
CLOCK: [2023-12-07 Thu 23:16]--[2023-12-07 Thu 23:41] =>  0:25
CLOCK: [2023-12-07 Thu 22:44]--[2023-12-07 Thu 23:09] =>  0:25
CLOCK: [2023-12-07 Thu 22:13]--[2023-12-07 Thu 22:38] =>  0:25
CLOCK: [2023-12-07 Thu 21:37]--[2023-12-07 Thu 22:02] =>  0:25
CLOCK: [2023-12-07 Thu 21:09]--[2023-12-07 Thu 21:34] =>  0:25
CLOCK: [2023-12-07 Thu 20:44]--[2023-12-07 Thu 21:09] =>  0:25
CLOCK: [2023-12-07 Thu 20:16]--[2023-12-07 Thu 20:41] =>  0:25
CLOCK: [2023-12-07 Thu 19:51]--[2023-12-07 Thu 20:16] =>  0:25
CLOCK: [2023-12-07 Thu 08:31]--[2023-12-07 Thu 08:56] =>  0:25
:END:
アイテムを追加する。

- item
  - consumable
  - name
  - description

まずそれぞれのコンポーネントの雛形をファイルで作成する。

- items
  - entityA
    - componentA(consumable)
    - componentB(weight)
  - entityB
    - componentA(consumable)
    - componentB(weight)

で、そのデータを読み込んでエンティティとコンポーネントを生成する関数を作る。

#+caption: engineも作らないといけない
#+begin_src go
	componentList := loader.EntityComponentList{}
	// engineとgameは同数でなければならない。分割されているのが面倒だな…
	componentList.Engine = append(componentList.Engine, loader.EngineComponentList{})
	componentList.Game = append(componentList.Game, gloader.GameComponentList{
		Item: &gc.Item{},
	})
	loader.AddEntities(world, componentList)
#+end_src

#+caption: 元ネタ
#+begin_src rust
pub fn spawn_named_item(
#+end_src
** DONE UI設計
CLOSED: [2023-12-10 Sun 12:55]
:LOGBOOK:
CLOCK: [2023-12-10 Sun 01:09]--[2023-12-10 Sun 01:34] =>  0:25
:END:
いちいちゲーム画面見るのもアレなので、書いておく。
** DONE UIエンティティだけを消す
CLOSED: [2023-12-10 Sun 12:55]
:LOGBOOK:
CLOCK: [2023-12-10 Sun 12:30]--[2023-12-10 Sun 12:55] =>  0:25
CLOCK: [2023-12-10 Sun 11:54]--[2023-12-10 Sun 12:19] =>  0:25
CLOCK: [2023-12-10 Sun 11:17]--[2023-12-10 Sun 11:42] =>  0:25
:END:
DeleteAllEntitiesでステート切り替え時のUIリセットをしている。entitiesが全部消えるので、困る。ほとんどの場合、UIだけをリセットすればよさそう。

UIコンポーネントと、UIコンポーネントを消す関数を作ればよさそう。
** DONE 各メニューを作成する
CLOSED: [2023-12-10 Sun 14:52]
:LOGBOOK:
CLOCK: [2023-12-10 Sun 14:22]--[2023-12-10 Sun 14:47] =>  0:25
CLOCK: [2023-12-10 Sun 13:53]--[2023-12-10 Sun 14:18] =>  0:25
CLOCK: [2023-12-10 Sun 13:12]--[2023-12-10 Sun 13:37] =>  0:25
:END:
仮の内容で全部作る。
** DONE アイテムを使う
CLOSED: [2023-12-24 Sun 08:38]
:PROPERTIES:
:Effort:   10:00
:END:
:LOGBOOK:
CLOCK: [2023-12-23 Sat 23:49]--[2023-12-24 Sun 00:14] =>  0:25
CLOCK: [2023-12-23 Sat 23:22]--[2023-12-23 Sat 23:47] =>  0:25
CLOCK: [2023-12-23 Sat 22:45]--[2023-12-23 Sat 23:10] =>  0:25
CLOCK: [2023-12-23 Sat 17:41]--[2023-12-23 Sat 18:06] =>  0:25
CLOCK: [2023-12-23 Sat 17:13]--[2023-12-23 Sat 17:38] =>  0:25
CLOCK: [2023-12-23 Sat 15:52]--[2023-12-23 Sat 16:17] =>  0:25
CLOCK: [2023-12-23 Sat 15:11]--[2023-12-23 Sat 15:36] =>  0:25
CLOCK: [2023-12-23 Sat 14:09]--[2023-12-23 Sat 14:34] =>  0:25
CLOCK: [2023-12-23 Sat 12:53]--[2023-12-23 Sat 13:18] =>  0:25
CLOCK: [2023-12-23 Sat 12:16]--[2023-12-23 Sat 12:41] =>  0:25
CLOCK: [2023-12-23 Sat 11:51]--[2023-12-23 Sat 12:16] =>  0:25
CLOCK: [2023-12-23 Sat 11:25]--[2023-12-23 Sat 11:50] =>  0:25
CLOCK: [2023-12-23 Sat 10:56]--[2023-12-23 Sat 11:21] =>  0:25
CLOCK: [2023-12-23 Sat 02:07]--[2023-12-23 Sat 02:32] =>  0:25
CLOCK: [2023-12-23 Sat 01:27]--[2023-12-23 Sat 01:52] =>  0:25
CLOCK: [2023-12-23 Sat 00:53]--[2023-12-23 Sat 01:18] =>  0:25
CLOCK: [2023-12-23 Sat 00:22]--[2023-12-23 Sat 00:47] =>  0:25
CLOCK: [2023-12-22 Fri 00:49]--[2023-12-22 Fri 01:14] =>  0:25
CLOCK: [2023-12-22 Fri 00:08]--[2023-12-22 Fri 00:33] =>  0:25
CLOCK: [2023-12-21 Thu 23:27]--[2023-12-21 Thu 23:52] =>  0:25
CLOCK: [2023-12-21 Thu 22:25]--[2023-12-21 Thu 22:50] =>  0:25
CLOCK: [2023-12-21 Thu 22:00]--[2023-12-21 Thu 22:25] =>  0:25
CLOCK: [2023-12-21 Thu 09:01]--[2023-12-21 Thu 09:26] =>  0:25
CLOCK: [2023-12-21 Thu 08:36]--[2023-12-21 Thu 09:01] =>  0:25
CLOCK: [2023-12-21 Thu 00:53]--[2023-12-21 Thu 01:18] =>  0:25
CLOCK: [2023-12-21 Thu 00:25]--[2023-12-21 Thu 00:50] =>  0:25
CLOCK: [2023-12-21 Thu 00:00]--[2023-12-21 Thu 00:25] =>  0:25
CLOCK: [2023-12-20 Wed 23:27]--[2023-12-20 Wed 23:52] =>  0:25
CLOCK: [2023-12-20 Wed 23:02]--[2023-12-20 Wed 23:27] =>  0:25
:END:

- キャラクタを作る
- ステータスを作る
- 影響を与えられるようにする
- memo
  - 可変のアイテムリストについて、選択中の印をつける必要がある
  - 選択中の座標をとってきて、選択印の位置を変化させればいいのかな

- ゲーム
  - 戦車にしたいけど、戦闘システムがややこしくなる
  - 合成とかで各自の装備メインにしたいんだよな
** DONE アイテムを選択して使えるようにする
CLOSED: [2023-12-24 Sun 10:19]
:PROPERTIES:
:Effort:   3:00
:END:
:LOGBOOK:
CLOCK: [2023-12-24 Sun 09:35]--[2023-12-24 Sun 10:00] =>  0:25
CLOCK: [2023-12-24 Sun 09:10]--[2023-12-24 Sun 09:35] =>  0:25
CLOCK: [2023-12-24 Sun 08:40]--[2023-12-24 Sun 09:05] =>  0:25
:END:
今は固定にしている。
** DONE アイテムリストをebitenUIで作る
CLOSED: [2023-12-30 Sat 17:04]
:LOGBOOK:
CLOCK: [2023-12-30 Sat 16:21]--[2023-12-30 Sat 16:46] =>  0:25
CLOCK: [2023-12-30 Sat 15:50]--[2023-12-30 Sat 16:15] =>  0:25
CLOCK: [2023-12-30 Sat 15:10]--[2023-12-30 Sat 15:35] =>  0:25
:END:
いい感じに、スクロールできるようにする。
** DONE サイドメニューを表示する
CLOSED: [2023-12-30 Sat 22:17]
:LOGBOOK:
CLOCK: [2023-12-30 Sat 18:21]--[2023-12-30 Sat 19:08] =>  0:47
:END:

性能を表示するサイドパネル。

- [X] メニューバーが太いのを直す
** DONE UIをリロードせずに反映できるようにする
CLOSED: [2024-01-03 Wed 17:33]
アイテムを使用したときにUIをリロードしているが、スクロール位置が元へ戻ってしまうのでリロードしないようにする。

また、表示ジャンルの切替もあるので、リロードすると保持しなくて困る。
