20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.html
<div id="outline-container-org24a82fc" class="outline-3">
<h3 id="org24a82fc"><a href="#org24a82fc"><span class="done DONE">DONE</span> 階数を移動できるようにする</a></h3>
<div class="outline-text-3" id="text-org24a82fc">
<p>
1階からはじまって、次の階層に移動する。
</p>

<p>
ワープホール。
</p>
</div>
</div>
<div id="outline-container-orgb365379" class="outline-3">
<h3 id="orgb365379"><a href="#orgb365379"><span class="done DONE">DONE</span> クロスコンパイルする</a></h3>
<div class="outline-text-3" id="text-orgb365379">
<p>
一応CIに設定して保証しておく。
</p>
</div>
</div>
<div id="outline-container-orgc2e2dda" class="outline-3">
<h3 id="orgc2e2dda"><a href="#orgc2e2dda"><span class="done DONE">DONE</span> メッセージが飛び出すのを直す</a></h3>
<div class="outline-text-3" id="text-orgc2e2dda">
<p>
ステート遷移イベントを作る。
</p>
</div>
</div>
<div id="outline-container-orgfb66c1d" class="outline-3">
<h3 id="orgfb66c1d"><a href="#orgfb66c1d"><span class="done DONE">DONE</span> 次の階をランダムに選択する</a></h3>
<div class="outline-text-3" id="text-orgfb66c1d">
<p>
一覧からランダムに選択する。
</p>
</div>
</div>
<div id="outline-container-orgb1fb2d5" class="outline-3">
<h3 id="orgb1fb2d5"><a href="#orgb1fb2d5"><span class="done DONE">DONE</span> HomeStateを作成する</a></h3>
<div class="outline-text-3" id="text-orgb1fb2d5">
<p>
ゲームプレイの基軸になるメニュー。
</p>
</div>
</div>
<div id="outline-container-org19a5156" class="outline-3">
<h3 id="org19a5156"><a href="#org19a5156"><span class="done DONE">DONE</span> 脱出できるようにする</a></h3>
<div class="outline-text-3" id="text-org19a5156">
<p>
脱出階層で脱出できるようにする。
</p>
</div>
</div>
<div id="outline-container-org3b82f39" class="outline-3">
<h3 id="org3b82f39"><a href="#org3b82f39"><span class="done DONE">DONE</span> 背景を設定する</a></h3>
<div class="outline-text-3" id="text-org3b82f39">
<p>
背景を追加する。スプライトはあるけど、同じでいいのか。いや、スプライトは1枚の画像を分割するものだから、同じ感じでは扱えないな。変えるとsystemも変えないといけない。面倒なのでとりあえずいいか。
</p>
</div>
</div>
<div id="outline-container-orgb356c9a" class="outline-3">
<h3 id="orgb356c9a"><a href="#orgb356c9a"><span class="done DONE">DONE</span> サブメニュー追加</a></h3>
<div class="outline-text-3" id="text-orgb356c9a">
<p>
拠点メニューにはサブメニューがある。どうやるか考える。
</p>

<ul class="org-ul">
<li>別stateでやる
<ul class="org-ul">
<li>大量にstateができるのどうなのという感じ。背景コンポーネントとかも同じ感じで準備しないといけない</li>
</ul></li>
<li>リファレンスではどうやっているのだろう。ポーズでは、後ろを透明に表示しつつ、メニューを表示している。あれと同じようなことができないか
<ul class="org-ul">
<li>ポーズメニューでは、OnStopでポーズメニューのエンティティのみを削除しているようだ。ほかのstateでは、すべてのエンティティを削除することが異なる</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga752ff7" class="outline-3">
<h3 id="orga752ff7"><a href="#orga752ff7"><span class="done DONE">DONE</span> pauseステート作成</a></h3>
<div class="outline-text-3" id="text-orga752ff7">
<p>
デバッグで便利なので。
</p>
</div>
</div>
<div id="outline-container-orgfe2f6f3" class="outline-3">
<h3 id="orgfe2f6f3"><a href="#orgfe2f6f3"><span class="done DONE">DONE</span> アイテムを生成する</a></h3>
<div class="outline-text-3" id="text-orgfe2f6f3">
<p>
アイテムを追加する。
</p>

<ul class="org-ul">
<li>item
<ul class="org-ul">
<li>consumable</li>
<li>name</li>
<li>description</li>
</ul></li>
</ul>

<p>
まずそれぞれのコンポーネントの雛形をファイルで作成する。
</p>

<ul class="org-ul">
<li>items
<ul class="org-ul">
<li>entityA
<ul class="org-ul">
<li>componentA(consumable)</li>
<li>componentB(weight)</li>
</ul></li>
<li>entityB
<ul class="org-ul">
<li>componentA(consumable)</li>
<li>componentB(weight)</li>
</ul></li>
</ul></li>
</ul>

<p>
で、そのデータを読み込んでエンティティとコンポーネントを生成する関数を作る。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>engineも作らないといけない</label><pre class="src src-go">componentList := loader.EntityComponentList{}
// engineとgameは同数でなければならない。分割されているのが面倒だな…
componentList.Engine = append(componentList.Engine, loader.EngineComponentList{})
componentList.Game = append(componentList.Game, gloader.GameComponentList{
	Item: &amp;gc.Item{},
})
loader.AddEntities(world, componentList)
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>元ネタ</label><pre class="src src-rust">pub fn spawn_named_item(
</pre>
</div>
</div>
</div>
<div id="outline-container-orge7773bc" class="outline-3">
<h3 id="orge7773bc"><a href="#orge7773bc"><span class="done DONE">DONE</span> UI設計</a></h3>
<div class="outline-text-3" id="text-orge7773bc">
<p>
いちいちゲーム画面見るのもアレなので、書いておく。
</p>
</div>
</div>
<div id="outline-container-orgdf0ac7c" class="outline-3">
<h3 id="orgdf0ac7c"><a href="#orgdf0ac7c"><span class="done DONE">DONE</span> UIエンティティだけを消す</a></h3>
<div class="outline-text-3" id="text-orgdf0ac7c">
<p>
DeleteAllEntitiesでステート切り替え時のUIリセットをしている。entitiesが全部消えるので、困る。ほとんどの場合、UIだけをリセットすればよさそう。
</p>

<p>
UIコンポーネントと、UIコンポーネントを消す関数を作ればよさそう。
</p>
</div>
</div>
<div id="outline-container-org5746f73" class="outline-3">
<h3 id="org5746f73"><a href="#org5746f73"><span class="done DONE">DONE</span> 各メニューを作成する</a></h3>
<div class="outline-text-3" id="text-org5746f73">
<p>
仮の内容で全部作る。
</p>
</div>
</div>
<div id="outline-container-org48731b5" class="outline-3">
<h3 id="org48731b5"><a href="#org48731b5"><span class="done DONE">DONE</span> アイテムを使う</a></h3>
<div class="outline-text-3" id="text-org48731b5">
<ul class="org-ul">
<li>キャラクタを作る</li>
<li>ステータスを作る</li>
<li>影響を与えられるようにする</li>
<li>memo
<ul class="org-ul">
<li>可変のアイテムリストについて、選択中の印をつける必要がある</li>
<li>選択中の座標をとってきて、選択印の位置を変化させればいいのかな</li>
</ul></li>

<li>ゲーム
<ul class="org-ul">
<li>戦車にしたいけど、戦闘システムがややこしくなる</li>
<li>合成とかで各自の装備メインにしたいんだよな</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org66845fa" class="outline-3">
<h3 id="org66845fa"><a href="#org66845fa"><span class="done DONE">DONE</span> アイテムを選択して使えるようにする</a></h3>
<div class="outline-text-3" id="text-org66845fa">
<p>
今は固定にしている。
</p>
</div>
</div>
<div id="outline-container-orgb9e589f" class="outline-3">
<h3 id="orgb9e589f"><a href="#orgb9e589f"><span class="done DONE">DONE</span> アイテムリストをebitenUIで作る</a></h3>
<div class="outline-text-3" id="text-orgb9e589f">
<p>
いい感じに、スクロールできるようにする。
</p>
</div>
</div>
<div id="outline-container-org4356c16" class="outline-3">
<h3 id="org4356c16"><a href="#org4356c16"><span class="done DONE">DONE</span> サイドメニューを表示する</a></h3>
<div class="outline-text-3" id="text-org4356c16">
<p>
性能を表示するサイドパネル。
</p>

<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> メニューバーが太いのを直す</li>
</ul>
</div>
</div>
<div id="outline-container-orga8e1825" class="outline-3">
<h3 id="orga8e1825"><a href="#orga8e1825"><span class="done DONE">DONE</span> UIをリロードせずに反映できるようにする</a></h3>
<div class="outline-text-3" id="text-orga8e1825">
<p>
アイテムを使用したときにUIをリロードしているが、スクロール位置が元へ戻ってしまうのでリロードしないようにする。
</p>

<p>
また、表示ジャンルの切替もあるので、リロードすると保持しなくて困る。
</p>
</div>
</div>
