20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.org
** DONE ebitenUIを使う
CLOSED: [2024-01-03 Wed 17:54]
:PROPERTIES:
:Effort:   5:00
:END:
:LOGBOOK:
CLOCK: [2023-12-30 Sat 16:46]--[2023-12-30 Sat 17:11] =>  0:25
CLOCK: [2023-12-30 Sat 10:57]--[2023-12-30 Sat 10:58] =>  0:01
CLOCK: [2023-12-29 Fri 22:25]--[2023-12-29 Fri 22:50] =>  0:25
CLOCK: [2023-12-29 Fri 21:59]--[2023-12-29 Fri 22:24] =>  0:25
CLOCK: [2023-12-27 Wed 17:57]--[2023-12-27 Wed 18:10] =>  0:13
CLOCK: [2023-12-27 Wed 15:31]--[2023-12-27 Wed 16:12] =>  0:41
CLOCK: [2023-12-27 Wed 00:52]--[2023-12-27 Wed 01:17] =>  0:25
CLOCK: [2023-12-27 Wed 00:27]--[2023-12-27 Wed 00:52] =>  0:25
CLOCK: [2023-12-25 Mon 23:46]--[2023-12-26 Tue 00:11] =>  0:25
CLOCK: [2023-12-25 Mon 23:11]--[2023-12-25 Mon 23:36] =>  0:25
CLOCK: [2023-12-25 Mon 22:46]--[2023-12-25 Mon 23:11] =>  0:25
CLOCK: [2023-12-25 Mon 22:02]--[2023-12-25 Mon 22:27] =>  0:25
CLOCK: [2023-12-25 Mon 21:36]--[2023-12-25 Mon 22:01] =>  0:25
CLOCK: [2023-12-24 Sun 23:19]--[2023-12-24 Sun 23:44] =>  0:25
CLOCK: [2023-12-24 Sun 22:52]--[2023-12-24 Sun 23:17] =>  0:25
CLOCK: [2023-12-24 Sun 22:27]--[2023-12-24 Sun 22:52] =>  0:25
CLOCK: [2023-12-24 Sun 20:37]--[2023-12-24 Sun 21:02] =>  0:25
CLOCK: [2023-12-24 Sun 19:26]--[2023-12-24 Sun 19:51] =>  0:25
CLOCK: [2023-12-24 Sun 18:57]--[2023-12-24 Sun 19:22] =>  0:25
CLOCK: [2023-12-24 Sun 18:28]--[2023-12-24 Sun 18:53] =>  0:25
CLOCK: [2023-12-24 Sun 18:02]--[2023-12-24 Sun 18:27] =>  0:25
CLOCK: [2023-12-24 Sun 17:25]--[2023-12-24 Sun 17:50] =>  0:25
CLOCK: [2023-12-24 Sun 15:58]--[2023-12-24 Sun 16:23] =>  0:25
CLOCK: [2023-12-24 Sun 15:32]--[2023-12-24 Sun 15:57] =>  0:25
CLOCK: [2023-12-24 Sun 15:07]--[2023-12-24 Sun 15:32] =>  0:25
:END:
使う。
** DONE アイテムに対するアクションを選べるようにする
CLOSED: [2024-01-03 Wed 18:19]
:LOGBOOK:
CLOCK: [2024-01-03 Wed 17:54]--[2024-01-03 Wed 18:19] =>  0:25
CLOCK: [2023-12-24 Sun 14:31]--[2023-12-24 Sun 14:56] =>  0:25
CLOCK: [2023-12-24 Sun 14:06]--[2023-12-24 Sun 14:31] =>  0:25
CLOCK: [2023-12-24 Sun 12:36]--[2023-12-24 Sun 13:01] =>  0:25
CLOCK: [2023-12-24 Sun 12:10]--[2023-12-24 Sun 12:35] =>  0:25
CLOCK: [2023-12-24 Sun 11:39]--[2023-12-24 Sun 12:04] =>  0:25
CLOCK: [2023-12-24 Sun 11:10]--[2023-12-24 Sun 11:35] =>  0:25
CLOCK: [2023-12-24 Sun 10:44]--[2023-12-24 Sun 11:09] =>  0:25
CLOCK: [2023-12-24 Sun 10:19]--[2023-12-24 Sun 10:44] =>  0:25
:END:
- [X] 使う
- [X] 捨てる
- [X] キャンセル

- ebitenUIを組み込もうとしている
  - うまくUpdateできてないからか、windowが開けない
  - 今の構造だと、作成したuiをDrawとUpdateの2つができない
    - UIもコンポーネント
- ebitenUIだとキーボード志向にしにくそう
  - いや対応できるか
** DONE メッセージシステムの命令追加
CLOSED: [2024-01-16 Tue 08:23]
:PROPERTIES:
:Effort:   5:00
:END:
:LOGBOOK:
CLOCK: [2024-01-15 Mon 23:34]--[2024-01-15 Mon 23:59] =>  0:25
CLOCK: [2024-01-15 Mon 22:57]--[2024-01-15 Mon 23:22] =>  0:25
CLOCK: [2024-01-15 Mon 22:15]--[2024-01-15 Mon 22:40] =>  0:25
CLOCK: [2024-01-15 Mon 21:50]--[2024-01-15 Mon 22:15] =>  0:25
CLOCK: [2024-01-15 Mon 00:32]--[2024-01-15 Mon 00:57] =>  0:25
CLOCK: [2024-01-14 Sun 22:29]--[2024-01-14 Sun 22:54] =>  0:25
CLOCK: [2024-01-14 Sun 22:02]--[2024-01-14 Sun 22:27] =>  0:25
CLOCK: [2024-01-14 Sun 21:27]--[2024-01-14 Sun 21:52] =>  0:25
CLOCK: [2024-01-14 Sun 20:44]--[2024-01-14 Sun 21:09] =>  0:25
CLOCK: [2024-01-14 Sun 20:19]--[2024-01-14 Sun 20:44] =>  0:25
CLOCK: [2024-01-14 Sun 19:52]--[2024-01-14 Sun 20:17] =>  0:25
CLOCK: [2024-01-14 Sun 16:41]--[2024-01-14 Sun 17:06] =>  0:25
CLOCK: [2024-01-14 Sun 16:14]--[2024-01-14 Sun 16:39] =>  0:25
CLOCK: [2024-01-14 Sun 15:44]--[2024-01-14 Sun 16:09] =>  0:25
CLOCK: [2024-01-14 Sun 15:16]--[2024-01-14 Sun 15:41] =>  0:25
CLOCK: [2024-01-14 Sun 15:01]--[2024-01-14 Sun 15:16] =>  0:15
CLOCK: [2024-01-14 Sun 14:30]--[2024-01-14 Sun 14:55] =>  0:25
CLOCK: [2024-01-14 Sun 14:02]--[2024-01-14 Sun 14:27] =>  0:25
CLOCK: [2024-01-14 Sun 13:36]--[2024-01-14 Sun 14:01] =>  0:25
CLOCK: [2024-01-14 Sun 13:10]--[2024-01-14 Sun 13:35] =>  0:25
CLOCK: [2024-01-14 Sun 12:42]--[2024-01-14 Sun 13:07] =>  0:25
CLOCK: [2024-01-14 Sun 12:14]--[2024-01-14 Sun 12:39] =>  0:25
CLOCK: [2024-01-14 Sun 11:37]--[2024-01-14 Sun 12:02] =>  0:25
CLOCK: [2024-01-14 Sun 11:11]--[2024-01-14 Sun 11:36] =>  0:25
CLOCK: [2024-01-14 Sun 10:39]--[2024-01-14 Sun 11:04] =>  0:25
CLOCK: [2024-01-14 Sun 10:14]--[2024-01-14 Sun 10:39] =>  0:25
:END:

背景とか。

- 文字列に開始の合図がないから、識別子との判断ができてないみたい
- 画像を重ねる順番を指定できない
- 倉庫番のポーズではできてるからできそう
  - ただポーズは表示順が後なので...。明らかにポーズ画面は後だ。メッセージシステムの場合は背景が後で変わる可能性がある。
** DONE インベントリメニューでpanicになる
CLOSED: [2024-01-19 Fri 00:24]
別のステートに遷移したあと、再び戻ってクリックするとエラーになる。

- アイテム選択
- 「使う」クリックでpanic
- partyContainerの数が2つずつ増えているようだ
- 1度しか付与されないようにしたら解決した
** DONE アイテムを使う対象を選べるようにする
CLOSED: [2024-01-20 Sat 11:58]
:PROPERTIES:
:Effort:   5:00
:END:
:LOGBOOK:
CLOCK: [2024-01-17 Wed 22:39]--[2024-01-17 Wed 23:04] =>  0:25
CLOCK: [2024-01-17 Wed 21:48]--[2024-01-17 Wed 22:13] =>  0:25
CLOCK: [2024-01-17 Wed 08:25]--[2024-01-17 Wed 08:51] =>  0:26
CLOCK: [2024-01-17 Wed 07:36]--[2024-01-17 Wed 08:01] =>  0:25
CLOCK: [2024-01-17 Wed 07:11]--[2024-01-17 Wed 07:36] =>  0:25
CLOCK: [2024-01-17 Wed 06:46]--[2024-01-17 Wed 07:11] =>  0:25
CLOCK: [2024-01-16 Tue 23:46]--[2024-01-17 Wed 00:11] =>  0:25
CLOCK: [2024-01-16 Tue 23:17]--[2024-01-16 Tue 23:42] =>  0:25
CLOCK: [2024-01-16 Tue 08:37]--[2024-01-16 Tue 09:02] =>  0:25
CLOCK: [2024-01-04 Thu 12:37]--[2024-01-04 Thu 13:02] =>  0:25
CLOCK: [2024-01-04 Thu 11:11]--[2024-01-04 Thu 11:36] =>  0:25
CLOCK: [2024-01-04 Thu 10:46]--[2024-01-04 Thu 11:11] =>  0:25
CLOCK: [2024-01-04 Thu 10:21]--[2024-01-04 Thu 10:46] =>  0:25
:END:
- 回復薬の場合は1人の味方を選ぶ
- 回復スプレーの場合は全員を選択している画面になる
- ロケット弾の場合は1人の敵を選ぶ
- 決めること
  - 使う対象
    - 敵
    - 味方
    - なし
  - 対象数
    - 単数
    - 複数
  - 使う場面
    - 戦闘中のみと制限されるものがある
    - 戦闘中
    - フィールド / 拠点

- パーティ一覧を表示する
- 選択したときに適用する
- ProvidesHealingがあるものは自動で仲間対象でも良い、が
** DONE ゲーム設計
CLOSED: [2024-01-20 Sat 11:55]
:LOGBOOK:
CLOCK: [2024-01-13 Sat 23:10]--[2024-01-13 Sat 23:35] =>  0:25
CLOCK: [2024-01-13 Sat 22:45]--[2024-01-13 Sat 23:10] =>  0:25
CLOCK: [2024-01-13 Sat 22:19]--[2024-01-13 Sat 22:44] =>  0:25
CLOCK: [2024-01-12 Fri 00:18]--[2024-01-12 Fri 00:43] =>  0:25
CLOCK: [2024-01-11 Thu 23:10]--[2024-01-11 Thu 23:35] =>  0:25
CLOCK: [2024-01-10 Wed 21:10]--[2024-01-10 Wed 21:35] =>  0:25
CLOCK: [2024-01-07 Sun 22:18]--[2024-01-07 Sun 22:43] =>  0:25
CLOCK: [2024-01-07 Sun 16:34]--[2024-01-07 Sun 16:59] =>  0:25
CLOCK: [2024-01-06 Sat 18:52]--[2024-01-06 Sat 19:17] =>  0:25
:END:
どうするか。
** DONE UIのリファクタ
CLOSED: [2024-02-18 Sun 16:58]
:LOGBOOK:
CLOCK: [2024-02-18 Sun 16:33]--[2024-02-18 Sun 16:58] =>  0:25
CLOCK: [2024-02-18 Sun 14:01]--[2024-02-18 Sun 14:26] =>  0:25
CLOCK: [2024-02-18 Sun 12:18]--[2024-02-18 Sun 12:43] =>  0:25
CLOCK: [2024-02-18 Sun 11:50]--[2024-02-18 Sun 12:15] =>  0:25
CLOCK: [2024-02-18 Sun 11:25]--[2024-02-18 Sun 11:50] =>  0:25
CLOCK: [2024-02-18 Sun 11:00]--[2024-02-18 Sun 11:25] =>  0:25
CLOCK: [2024-02-18 Sun 01:15]--[2024-02-18 Sun 01:40] =>  0:25
CLOCK: [2024-02-18 Sun 00:34]--[2024-02-18 Sun 00:59] =>  0:25
CLOCK: [2024-02-17 Sat 22:49]--[2024-02-17 Sat 23:14] =>  0:25
CLOCK: [2024-02-17 Sat 22:20]--[2024-02-17 Sat 22:45] =>  0:25
CLOCK: [2024-02-17 Sat 21:54]--[2024-02-17 Sat 22:19] =>  0:25
CLOCK: [2024-02-17 Sat 21:17]--[2024-02-17 Sat 21:42] =>  0:25
CLOCK: [2024-02-17 Sat 20:49]--[2024-02-17 Sat 21:14] =>  0:25
CLOCK: [2024-02-17 Sat 20:23]--[2024-02-17 Sat 20:48] =>  0:25
CLOCK: [2024-02-17 Sat 16:57]--[2024-02-17 Sat 17:22] =>  0:25
CLOCK: [2024-01-01 Mon 20:26]--[2024-01-01 Mon 20:51] =>  0:25
CLOCK: [2024-01-01 Mon 20:01]--[2024-01-01 Mon 20:26] =>  0:25
CLOCK: [2023-12-31 Sun 09:21]--[2023-12-31 Sun 09:46] =>  0:25
CLOCK: [2023-12-30 Sat 22:23]--[2023-12-30 Sat 22:48] =>  0:25
:END:

- [X] 統一感をもって扱えるようにする
- [X] 説明文とメニューの間隔を空ける
- resourceに各UI(idle, hover, pressed)を初期化しておく
- 参考コードを見てどうやっているかを調べる
- 完璧でなくてよい。やっても成果が見えなくて辛いので、次をやるか
- UI間に依存があって、思ったよりきれいに書けなかった感
- まあ、アイテム画面と同じスタイルで別のメニューを表示したくなったら考えればいい
** DONE 武器を追加する
CLOSED: [2024-02-18 Sun 22:56]
:LOGBOOK:
CLOCK: [2024-02-18 Sun 21:19]--[2024-02-18 Sun 21:44] =>  0:25
CLOCK: [2024-02-18 Sun 20:53]--[2024-02-18 Sun 21:18] =>  0:25
CLOCK: [2024-02-18 Sun 20:27]--[2024-02-18 Sun 20:52] =>  0:25
CLOCK: [2024-02-18 Sun 19:56]--[2024-02-18 Sun 20:21] =>  0:25
CLOCK: [2024-02-18 Sun 18:23]--[2024-02-18 Sun 18:48] =>  0:25
CLOCK: [2024-02-18 Sun 17:57]--[2024-02-18 Sun 18:22] =>  0:25
CLOCK: [2024-02-18 Sun 17:26]--[2024-02-18 Sun 17:51] =>  0:25
CLOCK: [2024-02-18 Sun 16:59]--[2024-02-18 Sun 17:24] =>  0:25
:END:
使うアイテムとは別枠で表示できる。

- 武器名
- 元となった武器名
- 攻撃力
- 命中
- 攻撃回数
- 属性
  - 拳銃
  - 小銃
  - 刀剣

武器の性能にはばらつきがある。種類によってベースがある。ばらつきやすさが違う。

メニューをトグルさせるためにどうするか。既存のchildを削除して、再度追加すればいいか。
** DONE 素材を追加する
CLOSED: [2024-02-21 Wed 00:20]
:LOGBOOK:
CLOCK: [2024-02-21 Wed 19:25]--[2024-02-21 Wed 19:50] =>  0:25
:END:
- 素材は表示が違う。個数を表示することになっている。どうするか
- 素材はグローバルに個数カウントできればよい。そのへんはほかのエンティティと事情が違う
- 表示方法を変えないといけないがどうするか
  - しょせん中のテキストが違うだけ
- [ ] 素材を追加する
  - 素材は個数カウント。エンティティを追加する必要はあるか。単なるmapでもよい
  - ただ、同じtomlで生成できるほうがわかりやすい。nameとdescriptionあるし

インターフェースから考える。

#+begin_src go
  // tomlにあるものはカウント0で初期化される

  material.GetCount("ガラクタ") // => 3
  material.IncCount("ガラクタ", 1)
  material.DeclCount("小さな花", 1)
#+end_src
