20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.html
<div id="outline-container-orgfb88896" class="outline-3">
<h3 id="orgfb88896"><a href="#orgfb88896"><span class="done DONE">DONE</span> ebitenUIを使う</a></h3>
<div class="outline-text-3" id="text-orgfb88896">
<p>
使う。
</p>
</div>
</div>
<div id="outline-container-orgb26fe79" class="outline-3">
<h3 id="orgb26fe79"><a href="#orgb26fe79"><span class="done DONE">DONE</span> アイテムに対するアクションを選べるようにする</a></h3>
<div class="outline-text-3" id="text-orgb26fe79">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 使う</li>
<li class="on"><input type='checkbox' checked='checked' /> 捨てる</li>
<li class="on"><input type='checkbox' checked='checked' /> キャンセル</li>

<li>ebitenUIを組み込もうとしている
<ul class="org-ul">
<li>うまくUpdateできてないからか、windowが開けない</li>
<li>今の構造だと、作成したuiをDrawとUpdateの2つができない
<ul class="org-ul">
<li>UIもコンポーネント</li>
</ul></li>
</ul></li>
<li>ebitenUIだとキーボード志向にしにくそう
<ul class="org-ul">
<li>いや対応できるか</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6aaf804" class="outline-3">
<h3 id="org6aaf804"><a href="#org6aaf804"><span class="done DONE">DONE</span> メッセージシステムの命令追加</a></h3>
<div class="outline-text-3" id="text-org6aaf804">
<p>
背景とか。
</p>

<ul class="org-ul">
<li>文字列に開始の合図がないから、識別子との判断ができてないみたい</li>
<li>画像を重ねる順番を指定できない</li>
<li>倉庫番のポーズではできてるからできそう
<ul class="org-ul">
<li>ただポーズは表示順が後なので&#x2026;。明らかにポーズ画面は後だ。メッセージシステムの場合は背景が後で変わる可能性がある。</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4bb010d" class="outline-3">
<h3 id="org4bb010d"><a href="#org4bb010d"><span class="done DONE">DONE</span> インベントリメニューでpanicになる</a></h3>
<div class="outline-text-3" id="text-org4bb010d">
<p>
別のステートに遷移したあと、再び戻ってクリックするとエラーになる。
</p>

<ul class="org-ul">
<li>アイテム選択</li>
<li>「使う」クリックでpanic</li>
<li>partyContainerの数が2つずつ増えているようだ</li>
<li>1度しか付与されないようにしたら解決した</li>
</ul>
</div>
</div>
<div id="outline-container-orgd9b740f" class="outline-3">
<h3 id="orgd9b740f"><a href="#orgd9b740f"><span class="done DONE">DONE</span> アイテムを使う対象を選べるようにする</a></h3>
<div class="outline-text-3" id="text-orgd9b740f">
<ul class="org-ul">
<li>回復薬の場合は1人の味方を選ぶ</li>
<li>回復スプレーの場合は全員を選択している画面になる</li>
<li>ロケット弾の場合は1人の敵を選ぶ</li>
<li>決めること
<ul class="org-ul">
<li>使う対象
<ul class="org-ul">
<li>敵</li>
<li>味方</li>
<li>なし</li>
</ul></li>
<li>対象数
<ul class="org-ul">
<li>単数</li>
<li>複数</li>
</ul></li>
<li>使う場面
<ul class="org-ul">
<li>戦闘中のみと制限されるものがある</li>
<li>戦闘中</li>
<li>フィールド / 拠点</li>
</ul></li>
</ul></li>

<li>パーティ一覧を表示する</li>
<li>選択したときに適用する</li>
<li>ProvidesHealingがあるものは自動で仲間対象でも良い、が</li>
</ul>
</div>
</div>
<div id="outline-container-orga63148a" class="outline-3">
<h3 id="orga63148a"><a href="#orga63148a"><span class="done DONE">DONE</span> ゲーム設計</a></h3>
<div class="outline-text-3" id="text-orga63148a">
<p>
どうするか。
</p>
</div>
</div>
<div id="outline-container-org0654a02" class="outline-3">
<h3 id="org0654a02"><a href="#org0654a02"><span class="done DONE">DONE</span> UIのリファクタ</a></h3>
<div class="outline-text-3" id="text-org0654a02">
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 統一感をもって扱えるようにする</li>
<li class="on"><input type='checkbox' checked='checked' /> 説明文とメニューの間隔を空ける</li>
<li>resourceに各UI(idle, hover, pressed)を初期化しておく</li>
<li>参考コードを見てどうやっているかを調べる</li>
<li>完璧でなくてよい。やっても成果が見えなくて辛いので、次をやるか</li>
<li>UI間に依存があって、思ったよりきれいに書けなかった感</li>
<li>まあ、アイテム画面と同じスタイルで別のメニューを表示したくなったら考えればいい</li>
</ul>
</div>
</div>
<div id="outline-container-org10e3721" class="outline-3">
<h3 id="org10e3721"><a href="#org10e3721"><span class="done DONE">DONE</span> 武器を追加する</a></h3>
<div class="outline-text-3" id="text-org10e3721">
<p>
使うアイテムとは別枠で表示できる。
</p>

<ul class="org-ul">
<li>武器名</li>
<li>元となった武器名</li>
<li>攻撃力</li>
<li>命中</li>
<li>攻撃回数</li>
<li>属性
<ul class="org-ul">
<li>拳銃</li>
<li>小銃</li>
<li>刀剣</li>
</ul></li>
</ul>

<p>
武器の性能にはばらつきがある。種類によってベースがある。ばらつきやすさが違う。
</p>

<p>
メニューをトグルさせるためにどうするか。既存のchildを削除して、再度追加すればいいか。
</p>
</div>
</div>
<div id="outline-container-org614a123" class="outline-3">
<h3 id="org614a123"><a href="#org614a123"><span class="done DONE">DONE</span> 素材を追加する</a></h3>
<div class="outline-text-3" id="text-org614a123">
<ul class="org-ul">
<li>素材は表示が違う。個数を表示することになっている。どうするか</li>
<li>素材はグローバルに個数カウントできればよい。そのへんはほかのエンティティと事情が違う</li>
<li>表示方法を変えないといけないがどうするか
<ul class="org-ul">
<li>しょせん中のテキストが違うだけ</li>
</ul></li>
<li class="off"><input type='checkbox' /> 素材を追加する
<ul class="org-ul">
<li>素材は個数カウント。エンティティを追加する必要はあるか。単なるmapでもよい</li>
<li>ただ、同じtomlで生成できるほうがわかりやすい。nameとdescriptionあるし</li>
</ul></li>
</ul>

<p>
インターフェースから考える。
</p>

<div class="org-src-container">
<pre class="src src-go">// tomlにあるものはカウント0で初期化される

material.GetCount("ガラクタ") // =&gt; 3
material.IncCount("ガラクタ", 1)
material.DeclCount("小さな花", 1)
</pre>
</div>
</div>
</div>
