20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.org
** DONE 合成画面を作る
CLOSED: [2024-02-23 Fri 01:49]
:LOGBOOK:
CLOCK: [2024-02-22 Thu 23:29]--[2024-02-22 Thu 23:54] =>  0:25
CLOCK: [2024-02-22 Thu 23:02]--[2024-02-22 Thu 23:27] =>  0:25
CLOCK: [2024-02-22 Thu 22:05]--[2024-02-22 Thu 22:30] =>  0:25
CLOCK: [2024-02-22 Thu 21:33]--[2024-02-22 Thu 21:58] =>  0:25
CLOCK: [2024-02-22 Thu 20:50]--[2024-02-22 Thu 21:15] =>  0:25
CLOCK: [2024-02-22 Thu 20:23]--[2024-02-22 Thu 20:48] =>  0:25
CLOCK: [2024-02-22 Thu 18:49]--[2024-02-22 Thu 19:14] =>  0:25
CLOCK: [2024-02-22 Thu 18:18]--[2024-02-22 Thu 18:43] =>  0:25
CLOCK: [2024-02-22 Thu 15:48]--[2024-02-22 Thu 16:13] =>  0:25
CLOCK: [2024-02-22 Thu 15:23]--[2024-02-22 Thu 15:48] =>  0:25
CLOCK: [2024-02-22 Thu 00:16]--[2024-02-22 Thu 00:41] =>  0:25
CLOCK: [2024-02-21 Wed 23:46]--[2024-02-22 Thu 00:11] =>  0:25
CLOCK: [2024-02-21 Wed 22:33]--[2024-02-21 Wed 22:58] =>  0:25
CLOCK: [2024-02-21 Wed 22:02]--[2024-02-21 Wed 22:27] =>  0:25
CLOCK: [2024-02-21 Wed 21:32]--[2024-02-21 Wed 21:57] =>  0:25
CLOCK: [2024-02-21 Wed 20:16]--[2024-02-21 Wed 20:41] =>  0:25
CLOCK: [2024-02-21 Wed 19:51]--[2024-02-21 Wed 20:16] =>  0:25
CLOCK: [2024-02-21 Wed 19:00]--[2024-02-21 Wed 19:25] =>  0:25
CLOCK: [2024-02-21 Wed 00:45]--[2024-02-21 Wed 01:10] =>  0:25
CLOCK: [2024-02-21 Wed 00:20]--[2024-02-21 Wed 00:45] =>  0:25
CLOCK: [2024-02-20 Tue 23:17]--[2024-02-20 Tue 23:42] =>  0:25
CLOCK: [2024-02-20 Tue 22:31]--[2024-02-20 Tue 22:56] =>  0:25
CLOCK: [2024-02-20 Tue 21:49]--[2024-02-20 Tue 22:14] =>  0:25
CLOCK: [2024-02-20 Tue 21:22]--[2024-02-20 Tue 21:47] =>  0:25
CLOCK: [2024-02-20 Tue 20:57]--[2024-02-20 Tue 21:22] =>  0:25
CLOCK: [2024-02-20 Tue 00:36]--[2024-02-20 Tue 01:01] =>  0:25
CLOCK: [2024-02-20 Tue 00:05]--[2024-02-20 Tue 00:30] =>  0:25
CLOCK: [2024-02-19 Mon 22:49]--[2024-02-19 Mon 23:14] =>  0:25
CLOCK: [2024-02-19 Mon 21:32]--[2024-02-19 Mon 21:57] =>  0:25
CLOCK: [2024-02-19 Mon 20:50]--[2024-02-19 Mon 21:16] =>  0:26
CLOCK: [2024-02-19 Mon 20:14]--[2024-02-19 Mon 20:39] =>  0:25
CLOCK: [2024-02-19 Mon 19:24]--[2024-02-19 Mon 19:49] =>  0:25
:END:
まず画面を作って、そこから共通化していけばいいか。

- 装備画面
- 合成画面
- 使用画面

これらは似たようなUIを持つ。

- カテゴリ選択
- アイテムメニュー(左)
  - 中身の取得ロジックは異なる
  - 中に入るデータの種類が違うということ
- 性能メニュー(右)

あたりは共通。ボタンのアクションが違うくらいか。

合成に必要なもの。

- レシピ
  - 素材の種類と個数
  - 鉄の剣 = ~[{鉄くず,2}, {木の棒,1}]~
- [X] レシピを表示する
- [X] 合成する関数を作成する
  - アイテム名からベースアイテムを作成する
  - 加工する
- [ ] レシピをもとに作成できるようにする
  - 所持数量とレシピを比較して満たしていると合成が選択できる
  - 合成を選択すると、所持数量を減らし該当アイテムを追加する

#+begin_src go
  gc := Craft("ハンドガン", 4) ecs.Entity // 品名、合成オプション
  Spawn(gc, spawntype.OnBackpack)
#+end_src
** DONE アイテムUIまわりをリファクタする
CLOSED: [2024-02-23 Fri 01:49]
:LOGBOOK:
CLOCK: [2024-02-18 Sun 23:40]--[2024-02-19 Mon 00:05] =>  0:25
CLOCK: [2024-02-18 Sun 23:01]--[2024-02-18 Sun 23:26] =>  0:25
:END:
- [X] グローバル変数を構造体のフィールドに移す

合成とか装備品変更とか、よく似たUIで別画面を作ることになる。別で作ってたら大変なことになる。再利用するためにはどうすればよいか。
** DONE 乗り物をどうするか
CLOSED: [2024-02-23 Fri 01:49]

結論、小さなSFチックな機械を導入する。戦闘には参加しないがサポートする。知能は持たない。

パーティ全体を強化できるようなのがあると面白そうに思える。乗り物はそういう強化が自然にできて面白い。人だけだとつけ外し要素がない。ただし、戦車だとシステムが複雑になる可能性がある。アイテム合成が生きないような。

- ドローンやタレットとか、自律的な何か
- 戦闘で交じるのはややこしくて困る
- 非戦闘な乗り物ってないな
- 歩数制限のもっともな理由がほしい
  - 燃料とか食べ物の類
- 小さなSFチックな機械を導入する。それがないと遺跡に入れない的な。いろいろ効果をつけられる
- 戦車は逆に敵が強くなるとかの理由をつけて遺跡に入らない。戦闘が面倒になるので
** DONE タイル移動でなくするか
CLOSED: [2024-02-23 Fri 01:57]
いやでもアニメーションやリアルタイムとなると大変そうだから、タイル移動のままがよさそう。

あまりローグライクさせる意味はなさそう。敵を避けにくい。banbandonを参考にして自由移動にするか。
** DONE 一貫させるためインターフェースを定義する
CLOSED: [2024-02-23 Fri 17:15]
stateごとにコードがバラバラで、直していくのが辛い。

一部共通部分もあるが、違う部分も多いので、しょうがないところではある。

インターフェース化して、ある程度同じにするか。とはいえ、アイテム画面がそこまで種類多いかと言われるとそうでもない。3、4個だからあまり神経質にならなくてもいい。
** DONE 武器コンポーネントに属性を追加する
CLOSED: [2024-02-23 Fri 21:30]
:LOGBOOK:
CLOCK: [2024-02-23 Fri 21:04]--[2024-02-23 Fri 21:30] =>  0:26
CLOCK: [2024-02-23 Fri 20:33]--[2024-02-23 Fri 20:58] =>  0:25
CLOCK: [2024-02-23 Fri 19:51]--[2024-02-23 Fri 20:16] =>  0:25
CLOCK: [2024-02-23 Fri 19:15]--[2024-02-23 Fri 19:40] =>  0:25
CLOCK: [2024-02-23 Fri 18:50]--[2024-02-23 Fri 19:15] =>  0:25
CLOCK: [2024-02-23 Fri 18:25]--[2024-02-23 Fri 18:50] =>  0:25
CLOCK: [2024-02-23 Fri 17:42]--[2024-02-23 Fri 18:07] =>  0:25
:END:
- 火炎(耐火)
- 電気(耐電)
- 光力(耐光)

だとそのまますぎるか。光は異色だが、SFらしさを出すのに良い。ややこしいのであまり属性を増やしたくない。冷気(耐冷)を追加した。

時代背景的に、SFではない。でも合成するとSFになるよな。SFよりの現代、でよいか。
** DONE アイテム種別に防具を追加する
CLOSED: [2024-02-24 Sat 17:57]
:LOGBOOK:
CLOCK: [2024-02-24 Sat 01:05]--[2024-02-24 Sat 01:30] =>  0:25
CLOCK: [2024-02-24 Sat 00:40]--[2024-02-24 Sat 01:05] =>  0:25
CLOCK: [2024-02-23 Fri 22:59]--[2024-02-23 Fri 23:24] =>  0:25
CLOCK: [2024-02-23 Fri 22:24]--[2024-02-23 Fri 22:49] =>  0:25
:END:
- 消耗品
- 武器
- 防具
- 素材

で、種別が揃う。
** DONE 武器種別を追加する
CLOSED: [2024-02-24 Sat 19:39]
:LOGBOOK:
CLOCK: [2024-02-24 Sat 19:07]--[2024-02-24 Sat 19:32] =>  0:25
CLOCK: [2024-02-24 Sat 18:07]--[2024-02-24 Sat 18:32] =>  0:25
:END:
剣とか銃とか。
** DONE 合成画面をリファクタする
CLOSED: [2024-02-24 Sat 19:33]
:LOGBOOK:
CLOCK: [2024-02-23 Fri 16:36]--[2024-02-23 Fri 17:01] =>  0:25
CLOCK: [2024-02-23 Fri 15:22]--[2024-02-23 Fri 15:47] =>  0:25
CLOCK: [2024-02-23 Fri 14:49]--[2024-02-23 Fri 15:14] =>  0:25
CLOCK: [2024-02-23 Fri 14:08]--[2024-02-23 Fri 14:33] =>  0:25
CLOCK: [2024-02-23 Fri 13:43]--[2024-02-23 Fri 14:08] =>  0:25
CLOCK: [2024-02-23 Fri 13:13]--[2024-02-23 Fri 13:38] =>  0:25
CLOCK: [2024-02-23 Fri 12:48]--[2024-02-23 Fri 13:13] =>  0:25
CLOCK: [2024-02-23 Fri 12:14]--[2024-02-23 Fri 12:39] =>  0:25
CLOCK: [2024-02-23 Fri 11:23]--[2024-02-23 Fri 11:48] =>  0:25
CLOCK: [2024-02-23 Fri 10:58]--[2024-02-23 Fri 11:23] =>  0:25
CLOCK: [2024-02-23 Fri 10:33]--[2024-02-23 Fri 10:58] =>  0:25
CLOCK: [2024-02-23 Fri 10:07]--[2024-02-23 Fri 10:32] =>  0:25
CLOCK: [2024-02-23 Fri 02:04]--[2024-02-23 Fri 02:29] =>  0:25
:END:
書き直す。
** DONE 装備画面を作る
CLOSED: [2024-02-26 Mon 23:01]
:LOGBOOK:
CLOCK: [2024-02-25 Sun 15:09]--[2024-02-25 Sun 15:34] =>  0:25
CLOCK: [2024-02-25 Sun 14:40]--[2024-02-25 Sun 15:05] =>  0:25
CLOCK: [2024-02-25 Sun 14:12]--[2024-02-25 Sun 14:37] =>  0:25
CLOCK: [2024-02-25 Sun 13:45]--[2024-02-25 Sun 14:10] =>  0:25
CLOCK: [2024-02-25 Sun 13:07]--[2024-02-25 Sun 13:32] =>  0:25
CLOCK: [2024-02-25 Sun 12:41]--[2024-02-25 Sun 13:06] =>  0:25
CLOCK: [2024-02-25 Sun 12:16]--[2024-02-25 Sun 12:41] =>  0:25
CLOCK: [2024-02-25 Sun 11:51]--[2024-02-25 Sun 12:16] =>  0:25
CLOCK: [2024-02-25 Sun 11:16]--[2024-02-25 Sun 11:41] =>  0:25
CLOCK: [2024-02-25 Sun 10:50]--[2024-02-25 Sun 11:15] =>  0:25
CLOCK: [2024-02-25 Sun 10:24]--[2024-02-25 Sun 10:49] =>  0:25
CLOCK: [2024-02-25 Sun 09:59]--[2024-02-25 Sun 10:24] =>  0:25
CLOCK: [2024-02-25 Sun 01:47]--[2024-02-25 Sun 02:12] =>  0:25
CLOCK: [2024-02-25 Sun 01:22]--[2024-02-25 Sun 01:47] =>  0:25
CLOCK: [2024-02-25 Sun 00:47]--[2024-02-25 Sun 01:12] =>  0:25
CLOCK: [2024-02-24 Sat 22:58]--[2024-02-24 Sat 23:23] =>  0:25
CLOCK: [2024-02-24 Sat 20:30]--[2024-02-24 Sat 20:55] =>  0:25
CLOCK: [2024-02-24 Sat 19:54]--[2024-02-24 Sat 20:19] =>  0:25
:END:
- [X] スロットを作成する
  - コードから装備させる
- [X] 装備画面を作成する
  - スロット表示画面。各キャラごと
- [X] 選択画面を作成する
  - ここで選択したものが前で選択したスロットに装備される
  - モードをどう表現するか。これをstateとしてやるのはやりすぎな気もする
  - 選択モードとだけしとけばいいか
  - 選択モードだと、左側を武器リストにする。スライダーがあるから、全く同じにならなそうだな
** DONE enumのバリデーション
CLOSED: [2024-03-01 Fri 22:19]
:LOGBOOK:
CLOCK: [2024-03-01 Fri 21:43]--[2024-03-01 Fri 22:08] =>  0:25
CLOCK: [2024-03-01 Fri 21:18]--[2024-03-01 Fri 21:43] =>  0:25
CLOCK: [2024-03-01 Fri 20:46]--[2024-03-01 Fri 21:11] =>  0:25
:END:
楽にバリデーションできる書き方にする。
** DONE カメラ追加
CLOSED: [2024-04-08 Mon 21:11]
:LOGBOOK:
CLOCK: [2024-04-11 Thu 00:26]--[2024-04-11 Thu 00:51] =>  0:25
CLOCK: [2024-04-08 Mon 20:27]--[2024-04-08 Mon 20:52] =>  0:25
CLOCK: [2024-04-08 Mon 20:02]--[2024-04-08 Mon 20:27] =>  0:25
CLOCK: [2024-04-08 Mon 19:31]--[2024-04-08 Mon 19:56] =>  0:25
CLOCK: [2024-04-08 Mon 18:33]--[2024-04-08 Mon 18:58] =>  0:25
:END:
今はそのまま表示してる。プレイヤーの位置に追従してステージの一部だけを表示したい。

とりあえず、仮で追加した。
** CLOSE UIと分離したい
CLOSED: [2024-04-08 Mon 01:38]
:LOGBOOK:
CLOCK: [2024-04-08 Mon 00:48]--[2024-04-08 Mon 01:13] =>  0:25
CLOCK: [2024-04-07 Sun 23:30]--[2024-04-07 Sun 23:55] =>  0:25
CLOCK: [2024-04-07 Sun 22:37]--[2024-04-07 Sun 23:02] =>  0:25
CLOCK: [2024-04-07 Sun 22:11]--[2024-04-07 Sun 22:36] =>  0:25
CLOCK: [2024-04-07 Sun 21:45]--[2024-04-07 Sun 22:10] =>  0:25
CLOCK: [2024-04-07 Sun 20:07]--[2024-04-07 Sun 20:32] =>  0:25
:END:
完全にUIと一体化しているのでよくわからなくなる。

- UIを保持する構造体
- UIで表示されているボタンに設定されたイベントがトリガーされて、ECSクエリを実行して表示を切り替えたり追加したりする
- stateはviewだと考えてよさそうな感じがする
- データストアと直にやりとりしてるわけじゃないからいいのか。UIの変更だけだな
** DONE 装備画面のリファクタ
CLOSED: [2024-04-13 Sat 12:59]
:LOGBOOK:
CLOCK: [2024-04-13 Sat 12:03]--[2024-04-13 Sat 12:28] =>  0:25
CLOCK: [2024-04-13 Sat 11:33]--[2024-04-13 Sat 11:58] =>  0:25
CLOCK: [2024-04-12 Fri 00:47]--[2024-04-12 Fri 01:12] =>  0:25
CLOCK: [2024-04-11 Thu 22:37]--[2024-04-11 Thu 23:02] =>  0:25
CLOCK: [2024-04-11 Thu 22:12]--[2024-04-11 Thu 22:37] =>  0:25
CLOCK: [2024-04-11 Thu 21:45]--[2024-04-11 Thu 22:10] =>  0:25
CLOCK: [2024-04-11 Thu 21:19]--[2024-04-11 Thu 21:44] =>  0:25
CLOCK: [2024-02-29 Thu 23:32]--[2024-02-29 Thu 23:57] =>  0:25
CLOCK: [2024-02-29 Thu 23:07]--[2024-02-29 Thu 23:32] =>  0:25
CLOCK: [2024-02-26 Mon 23:03]--[2024-02-26 Mon 23:29] =>  0:26
:END:
汚いので直す。

どこから直せばいいのかよくわからないな。
** DONE ステータスを追加する
CLOSED: [2024-04-13 Sat 14:14]
:LOGBOOK:
CLOCK: [2024-04-13 Sat 13:25]--[2024-04-13 Sat 13:50] =>  0:25
CLOCK: [2024-04-13 Sat 12:59]--[2024-04-13 Sat 13:24] =>  0:25
:END:
生命力とか、力とか。
