20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.org
** DONE 装備でステータスを変更する
CLOSED: [2024-04-14 Sun 10:24]
:LOGBOOK:
CLOCK: [2024-04-13 Sat 23:37]--[2024-04-14 Sun 00:02] =>  0:25
CLOCK: [2024-04-13 Sat 22:40]--[2024-04-13 Sat 23:05] =>  0:25
CLOCK: [2024-04-13 Sat 22:09]--[2024-04-13 Sat 22:34] =>  0:25
CLOCK: [2024-04-13 Sat 21:40]--[2024-04-13 Sat 22:05] =>  0:25
CLOCK: [2024-04-13 Sat 21:02]--[2024-04-13 Sat 21:27] =>  0:25
CLOCK: [2024-04-13 Sat 20:36]--[2024-04-13 Sat 21:01] =>  0:25
CLOCK: [2024-04-13 Sat 20:11]--[2024-04-13 Sat 20:36] =>  0:25
CLOCK: [2024-04-13 Sat 19:46]--[2024-04-13 Sat 20:11] =>  0:25
CLOCK: [2024-04-13 Sat 18:14]--[2024-04-13 Sat 18:39] =>  0:25
CLOCK: [2024-04-13 Sat 17:37]--[2024-04-13 Sat 18:02] =>  0:25
CLOCK: [2024-04-13 Sat 17:11]--[2024-04-13 Sat 17:36] =>  0:25
CLOCK: [2024-04-13 Sat 16:38]--[2024-04-13 Sat 17:03] =>  0:25
CLOCK: [2024-04-13 Sat 16:06]--[2024-04-13 Sat 16:31] =>  0:25
CLOCK: [2024-04-13 Sat 15:33]--[2024-04-13 Sat 15:58] =>  0:25
CLOCK: [2024-04-13 Sat 15:07]--[2024-04-13 Sat 15:32] =>  0:25
CLOCK: [2024-04-13 Sat 14:40]--[2024-04-13 Sat 15:05] =>  0:25
CLOCK: [2024-04-13 Sat 14:15]--[2024-04-13 Sat 14:40] =>  0:25
:END:
防具を装備すると防御力が上がるなど。

- キャラ固有のステータスは、Attributes
  - キャラごとに固有の値をもつ
  - 装備によって上がることがある
- 防御力はどうするか
  - キャラごとに固有の値をもたない。装備がなければみんな0となる
- 防御力以外が上がることもある。武器、防具どちらでも。
  - 器用さ+1などのステータス値
  - 火耐性+20%などの属性耐性
  - 頑丈+1、貫通+2などのスキル
  - 「救護」「乱射」などの行動追加
** DONE 説明図を書く
CLOSED: [2024-04-14 Sun 19:48]
:LOGBOOK:
CLOCK: [2024-04-14 Sun 19:19]--[2024-04-14 Sun 19:44] =>  0:25
:END:

見返してみるとけっこういい図がある。概念整理する。
** DONE 回復薬を割合回復にする
CLOSED: [2024-04-14 Sun 19:48]
:LOGBOOK:
CLOCK: [2024-04-14 Sun 18:53]--[2024-04-14 Sun 19:18] =>  0:25
CLOCK: [2024-04-14 Sun 16:33]--[2024-04-14 Sun 16:58] =>  0:25
CLOCK: [2024-04-14 Sun 14:58]--[2024-04-14 Sun 15:23] =>  0:25
CLOCK: [2024-04-14 Sun 14:23]--[2024-04-14 Sun 14:48] =>  0:25
CLOCK: [2024-04-14 Sun 13:43]--[2024-04-14 Sun 14:08] =>  0:25
CLOCK: [2024-04-14 Sun 13:17]--[2024-04-14 Sun 13:42] =>  0:25
CLOCK: [2024-04-14 Sun 12:52]--[2024-04-14 Sun 13:17] =>  0:25
CLOCK: [2024-04-14 Sun 12:27]--[2024-04-14 Sun 12:52] =>  0:25
CLOCK: [2024-04-14 Sun 11:40]--[2024-04-14 Sun 12:05] =>  0:25
CLOCK: [2024-04-14 Sun 11:15]--[2024-04-14 Sun 11:40] =>  0:25
CLOCK: [2024-04-14 Sun 10:49]--[2024-04-14 Sun 11:14] =>  0:25
CLOCK: [2024-04-14 Sun 10:24]--[2024-04-14 Sun 10:49] =>  0:25
:END:

- 固定値ではないようにする
- 割合回復の仕組みは作ったので、回復薬に適用する
- components, raw, effect をいい感じにしていく作業。大体同じ構造体になる
- 直にeffectを追加するのはよくないかもな。アイテムと共通に、いったんcomponentsを渡してeffectに変換させるようにする
** DONE 戦闘部分の設計
CLOSED: [2024-04-20 Sat 00:00]
:LOGBOOK:
CLOCK: [2024-04-17 Wed 21:55]--[2024-04-17 Wed 22:20] =>  0:25
CLOCK: [2024-04-17 Wed 21:26]--[2024-04-17 Wed 21:51] =>  0:25
CLOCK: [2024-04-17 Wed 20:46]--[2024-04-17 Wed 21:11] =>  0:25
CLOCK: [2024-04-17 Wed 20:15]--[2024-04-17 Wed 20:40] =>  0:25
CLOCK: [2024-04-17 Wed 19:35]--[2024-04-17 Wed 20:00] =>  0:25
CLOCK: [2024-04-17 Wed 19:10]--[2024-04-17 Wed 19:35] =>  0:25
CLOCK: [2024-04-17 Wed 00:25]--[2024-04-17 Wed 00:50] =>  0:25
CLOCK: [2024-04-17 Wed 00:00]--[2024-04-17 Wed 00:25] =>  0:25
CLOCK: [2024-04-16 Tue 00:16]--[2024-04-16 Tue 00:41] =>  0:25
CLOCK: [2024-04-15 Mon 21:38]--[2024-04-15 Mon 22:03] =>  0:25
CLOCK: [2024-04-15 Mon 21:03]--[2024-04-15 Mon 21:28] =>  0:25
CLOCK: [2024-04-15 Mon 00:20]--[2024-04-15 Mon 00:45] =>  0:25
CLOCK: [2024-04-14 Sun 23:41]--[2024-04-15 Mon 00:06] =>  0:25
CLOCK: [2024-04-14 Sun 21:09]--[2024-04-14 Sun 21:34] =>  0:25
CLOCK: [2024-04-14 Sun 20:36]--[2024-04-14 Sun 21:01] =>  0:25
:END:
未知の部分。どうするか。

- デッキ型にすると面白そうだなあ
  - 取れる行動が毎回異なる
  - マイナス行動は手札を圧迫する
  - カードには消費コストが設定されているから、強いものを選べばいいというわけでもない
  - ターンに行動カードは1枚選ぶ
  - デッキに1枚しか設定されてないと、それしか出なくないか。10枚登録固定にすればいいか

- 白瀬
  - 行動カード
    - マシンガン(sp2) by 装備武器
    - 防御(シールド装備, sp1)
    - 回復(体力回復, アイテム消費) by 所持スキル
    - 乱射(攻撃回数1.5倍, sp1) by 装備
    - 狙撃(待ち時間1.5倍+攻撃力2倍, sp2) by 所持スキル
  - パッシブスキル
    - 連携LV2(連携率1.4倍) by 所持スキル
    - 射撃LV1(命中率1.1倍, 射撃武器の攻撃力1.1倍) by 所持スキル
- ピエロ
  - 行動カード
    - レーザーブレード(装備武器, sp2)
    - 高出力(炎属性, sp2) by 装備
    - 応援 by 固有行動
- 選択
  - 基本攻撃(白瀬)
  - 基本攻撃(ピエロ)

デッキ。

参考。

- デッキは共通のことが多いようだ
  - 特定の人ばかり攻撃することにならないのだろうか
  - チームとは別に、人ごとの行動力もある
  - 同じターンで複数行動はコスト増加する
  - コスト増加しないものもある
  - ドローしなくても使えるものがある
- ターンごとに行動力が回復する。戦闘ごとにリセット
- カードのストックはできない
  - 毎回同じにならない
- カードの入手はランダム
- 装備が2枠ある
- 戦闘と関係ないサポートキャラが1人いる

それをふまえて。

- 調整が難しいので、もっとシンプルなルールがよさそう
- ランダム制はそこまでなくてよい
- 頭脳や運というよりはRPG的な、レベル上げて準備すれば勝てる要素強めにしたい
- カスタム性を高めたい
- アイテムのアップグレード要素はなし
- 特殊攻撃がついたカードはどう扱うか。あるなしどっちもほしい
  - 2枚生成させるか
  - 合成結果は複数になることがある
  - アイテム取得全般が、複数あるのを考慮しておく
  - ある武器に対して、アクションが複数選べるというのが自然だ
  - アクションは、他のカードを強化するカードでよさそう
- カードとアクションは変えたいんだよな
- 防具とかどうする
  - 基本パラメータは変わらないでいいのか
  - デッキに含めるとパラメータUPでよさそう
- カードは直に入手できるのか、合成で入手するのか
  - ダンジョン内で入手したやつを試せたほうがよさそう
  - 制限ともいえるが...
  - 入手は完全ランダム。1度入手すると合成で複数手に入れやすい

実装。

- じつはEffectと同じように、組み合わせてエンティティにしておけばいいだけか
  - アクションカードは攻撃を与える性質や、回復する性質がついていればよい。あと対象が敵か味方か、単数か
  - ブーストカードは、変化させる内容を保持していればよい。あと対象が敵か味方か、単数か
** DONE UpdateSpecに渡すComponentsの更新を忘れる
CLOSED: [2024-04-19 Fri 00:59]
:LOGBOOK:
CLOCK: [2024-04-19 Fri 00:33]--[2024-04-19 Fri 00:58] =>  0:25
:END:
オートで全コンポーネントを対象にすればよさそう。

componentListに渡せばよい。

** DONE 防具ジャンルを消す
CLOSED: [2024-04-19 Fri 00:59]
:LOGBOOK:
CLOCK: [2024-04-18 Thu 22:22]--[2024-04-18 Thu 22:47] =>  0:25
CLOCK: [2024-04-18 Thu 21:54]--[2024-04-18 Thu 22:19] =>  0:25
CLOCK: [2024-04-18 Thu 21:27]--[2024-04-18 Thu 21:52] =>  0:25
CLOCK: [2024-04-18 Thu 21:02]--[2024-04-18 Thu 21:27] =>  0:25
CLOCK: [2024-04-18 Thu 00:29]--[2024-04-18 Thu 00:54] =>  0:25
CLOCK: [2024-04-18 Thu 00:04]--[2024-04-18 Thu 00:29] =>  0:25
:END:
あまり区分けする必要はなさそうか。あの正方形のUIにすれば、混ざって入っていてもあまり違和感はない。

ただ、合成のときは分けたい感じも。

- アイテム
  - 消耗品
  - 売却アイテム
  - 防具
- 手札
  - アクションカード
  - サポートカード

メモ。

- なぜかInBackpackの条件で、結果に入らない
  - 装備してるせいだった...
** CLOSE アイテム以外でeffectをトリガーする方法
CLOSED: [2024-04-20 Sat 00:07]

今はまだ、アイテムトリガーしかない。AddItemで、コンポーネントに分解されてそれぞれEffectのキューに入り、実行される。

ただ、今後全回復とか、アイテム以外で何かしたいときが増える。そのときはどうするか。
** DONE メインメニューを開いているとCPU使用率が爆増する
CLOSED: [2024-04-21 Sun 01:13]
:LOGBOOK:
CLOCK: [2024-04-20 Sat 21:59]--[2024-04-20 Sat 22:24] =>  0:25
CLOCK: [2024-04-20 Sat 21:23]--[2024-04-20 Sat 21:48] =>  0:25
CLOCK: [2024-04-20 Sat 20:49]--[2024-04-20 Sat 21:14] =>  0:25
CLOCK: [2024-04-20 Sat 20:22]--[2024-04-20 Sat 20:47] =>  0:25
CLOCK: [2024-04-20 Sat 19:47]--[2024-04-20 Sat 20:12] =>  0:25
CLOCK: [2024-04-20 Sat 18:50]--[2024-04-20 Sat 19:15] =>  0:25
CLOCK: [2024-04-20 Sat 17:13]--[2024-04-20 Sat 17:38] =>  0:25
:END:
リークしている。

- フィールド画面でも起こるな
- ほかの画面では起こらない。どうもメニューの仕組みを使っているところで起きてそう

#+begin_src shell
  ps aux | head -n 1
#+end_src

#+RESULTS:
#+begin_src
USER         PID %CPU %MEM    VSZ   RSS TTY      STAT START   TIME COMMAND
#+end_src

- ほかの画面でも、タブを切り替えたときなどに発生する。生成した画面を生成できてないんだろうな
- RemoveChildren()で、表示されなくはなっているけど、それがガベージコレクションされてない
- プロファイラの設定した
- LoadFont()設定があると、残り続けるな。ないと、残らない
- ずっとコンテナの親子関係に問題があると考えていた(RemoveChildrenまわり)けど、そうではなかった
- Faceまわりを毎回初期化してたのを、リソース構造体に保存して、それを使うようにしたら解決した
- なんだかよくわからないな
- 相変わらず微妙に増えてるように見えるが、freeされてるようにも見える
** DONE 画像回帰テスト
CLOSED: [2024-04-21 Sun 20:41]
:LOGBOOK:
CLOCK: [2024-04-21 Sun 18:34]--[2024-04-21 Sun 18:59] =>  0:25
CLOCK: [2024-04-21 Sun 17:54]--[2024-04-21 Sun 18:19] =>  0:25
CLOCK: [2024-04-21 Sun 17:29]--[2024-04-21 Sun 17:54] =>  0:25
CLOCK: [2024-04-21 Sun 16:59]--[2024-04-21 Sun 17:24] =>  0:25
CLOCK: [2024-04-21 Sun 16:33]--[2024-04-21 Sun 16:58] =>  0:25
CLOCK: [2024-04-21 Sun 12:02]--[2024-04-21 Sun 12:27] =>  0:25
CLOCK: [2024-04-21 Sun 11:35]--[2024-04-21 Sun 12:00] =>  0:25
CLOCK: [2024-04-21 Sun 11:10]--[2024-04-21 Sun 11:35] =>  0:25
CLOCK: [2024-04-21 Sun 10:45]--[2024-04-21 Sun 11:10] =>  0:25
CLOCK: [2024-04-21 Sun 10:20]--[2024-04-21 Sun 10:45] =>  0:25
:END:
コマンドで各ステートの画像を取れるようにする。
** DONE メモリリークをCIで検知したい
CLOSED: [2024-04-21 Sun 21:03]
:LOGBOOK:
CLOCK: [2024-04-21 Sun 01:13]--[2024-04-21 Sun 01:38] =>  0:25
:END:

まあパフォーマンスを画面表示してるし、わかるだろう。

一定期間起動して、一定になるか確かめるとよさそう。
** DONE ホーム画面をクリック対応する
CLOSED: [2024-04-22 Mon 01:01]
:LOGBOOK:
CLOCK: [2024-04-21 Sun 22:42]--[2024-04-21 Sun 23:07] =>  0:25
CLOCK: [2024-04-21 Sun 21:47]--[2024-04-21 Sun 22:12] =>  0:25
:END:
キーボードはとりあえずなくした。

今はキーボードでしか移動できない。

でもキーボード移動も残したい。
