20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.html
<div id="outline-container-orgb39ef8a" class="outline-3">
<h3 id="orgb39ef8a"><a href="#orgb39ef8a"><span class="done DONE">DONE</span> 装備でステータスを変更する</a></h3>
<div class="outline-text-3" id="text-orgb39ef8a">
<p>
防具を装備すると防御力が上がるなど。
</p>

<ul class="org-ul">
<li>キャラ固有のステータスは、Attributes
<ul class="org-ul">
<li>キャラごとに固有の値をもつ</li>
<li>装備によって上がることがある</li>
</ul></li>
<li>防御力はどうするか
<ul class="org-ul">
<li>キャラごとに固有の値をもたない。装備がなければみんな0となる</li>
</ul></li>
<li>防御力以外が上がることもある。武器、防具どちらでも。
<ul class="org-ul">
<li>器用さ+1などのステータス値</li>
<li>火耐性+20%などの属性耐性</li>
<li>頑丈+1、貫通+2などのスキル</li>
<li>「救護」「乱射」などの行動追加</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org822a300" class="outline-3">
<h3 id="org822a300"><a href="#org822a300"><span class="done DONE">DONE</span> 説明図を書く</a></h3>
<div class="outline-text-3" id="text-org822a300">
<p>
見返してみるとけっこういい図がある。概念整理する。
</p>
</div>
</div>
<div id="outline-container-orgecbdf04" class="outline-3">
<h3 id="orgecbdf04"><a href="#orgecbdf04"><span class="done DONE">DONE</span> 回復薬を割合回復にする</a></h3>
<div class="outline-text-3" id="text-orgecbdf04">
<ul class="org-ul">
<li>固定値ではないようにする</li>
<li>割合回復の仕組みは作ったので、回復薬に適用する</li>
<li>components, raw, effect をいい感じにしていく作業。大体同じ構造体になる</li>
<li>直にeffectを追加するのはよくないかもな。アイテムと共通に、いったんcomponentsを渡してeffectに変換させるようにする</li>
</ul>
</div>
</div>
<div id="outline-container-org24b54f2" class="outline-3">
<h3 id="org24b54f2"><a href="#org24b54f2"><span class="done DONE">DONE</span> 戦闘部分の設計</a></h3>
<div class="outline-text-3" id="text-org24b54f2">
<p>
未知の部分。どうするか。
</p>

<ul class="org-ul">
<li>デッキ型にすると面白そうだなあ
<ul class="org-ul">
<li>取れる行動が毎回異なる</li>
<li>マイナス行動は手札を圧迫する</li>
<li>カードには消費コストが設定されているから、強いものを選べばいいというわけでもない</li>
<li>ターンに行動カードは1枚選ぶ</li>
<li>デッキに1枚しか設定されてないと、それしか出なくないか。10枚登録固定にすればいいか</li>
</ul></li>

<li>白瀬
<ul class="org-ul">
<li>行動カード
<ul class="org-ul">
<li>マシンガン(sp2) by 装備武器</li>
<li>防御(シールド装備, sp1)</li>
<li>回復(体力回復, アイテム消費) by 所持スキル</li>
<li>乱射(攻撃回数1.5倍, sp1) by 装備</li>
<li>狙撃(待ち時間1.5倍+攻撃力2倍, sp2) by 所持スキル</li>
</ul></li>
<li>パッシブスキル
<ul class="org-ul">
<li>連携LV2(連携率1.4倍) by 所持スキル</li>
<li>射撃LV1(命中率1.1倍, 射撃武器の攻撃力1.1倍) by 所持スキル</li>
</ul></li>
</ul></li>
<li>ピエロ
<ul class="org-ul">
<li>行動カード
<ul class="org-ul">
<li>レーザーブレード(装備武器, sp2)</li>
<li>高出力(炎属性, sp2) by 装備</li>
<li>応援 by 固有行動</li>
</ul></li>
</ul></li>
<li>選択
<ul class="org-ul">
<li>基本攻撃(白瀬)</li>
<li>基本攻撃(ピエロ)</li>
</ul></li>
</ul>

<p>
デッキ。
</p>

<p>
参考。
</p>

<ul class="org-ul">
<li>デッキは共通のことが多いようだ
<ul class="org-ul">
<li>特定の人ばかり攻撃することにならないのだろうか</li>
<li>チームとは別に、人ごとの行動力もある</li>
<li>同じターンで複数行動はコスト増加する</li>
<li>コスト増加しないものもある</li>
<li>ドローしなくても使えるものがある</li>
</ul></li>
<li>ターンごとに行動力が回復する。戦闘ごとにリセット</li>
<li>カードのストックはできない
<ul class="org-ul">
<li>毎回同じにならない</li>
</ul></li>
<li>カードの入手はランダム</li>
<li>装備が2枠ある</li>
<li>戦闘と関係ないサポートキャラが1人いる</li>
</ul>

<p>
それをふまえて。
</p>

<ul class="org-ul">
<li>調整が難しいので、もっとシンプルなルールがよさそう</li>
<li>ランダム制はそこまでなくてよい</li>
<li>頭脳や運というよりはRPG的な、レベル上げて準備すれば勝てる要素強めにしたい</li>
<li>カスタム性を高めたい</li>
<li>アイテムのアップグレード要素はなし</li>
<li>特殊攻撃がついたカードはどう扱うか。あるなしどっちもほしい
<ul class="org-ul">
<li>2枚生成させるか</li>
<li>合成結果は複数になることがある</li>
<li>アイテム取得全般が、複数あるのを考慮しておく</li>
<li>ある武器に対して、アクションが複数選べるというのが自然だ</li>
<li>アクションは、他のカードを強化するカードでよさそう</li>
</ul></li>
<li>カードとアクションは変えたいんだよな</li>
<li>防具とかどうする
<ul class="org-ul">
<li>基本パラメータは変わらないでいいのか</li>
<li>デッキに含めるとパラメータUPでよさそう</li>
</ul></li>
<li>カードは直に入手できるのか、合成で入手するのか
<ul class="org-ul">
<li>ダンジョン内で入手したやつを試せたほうがよさそう</li>
<li>制限ともいえるが&#x2026;</li>
<li>入手は完全ランダム。1度入手すると合成で複数手に入れやすい</li>
</ul></li>
</ul>

<p>
実装。
</p>

<ul class="org-ul">
<li>じつはEffectと同じように、組み合わせてエンティティにしておけばいいだけか
<ul class="org-ul">
<li>アクションカードは攻撃を与える性質や、回復する性質がついていればよい。あと対象が敵か味方か、単数か</li>
<li>ブーストカードは、変化させる内容を保持していればよい。あと対象が敵か味方か、単数か</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org279a34e" class="outline-3">
<h3 id="org279a34e"><a href="#org279a34e"><span class="done DONE">DONE</span> UpdateSpecに渡すComponentsの更新を忘れる</a></h3>
<div class="outline-text-3" id="text-org279a34e">
<p>
オートで全コンポーネントを対象にすればよさそう。
</p>

<p>
componentListに渡せばよい。
</p>
</div>
</div>

<div id="outline-container-orgc35289f" class="outline-3">
<h3 id="orgc35289f"><a href="#orgc35289f"><span class="done DONE">DONE</span> 防具ジャンルを消す</a></h3>
<div class="outline-text-3" id="text-orgc35289f">
<p>
あまり区分けする必要はなさそうか。あの正方形のUIにすれば、混ざって入っていてもあまり違和感はない。
</p>

<p>
ただ、合成のときは分けたい感じも。
</p>

<ul class="org-ul">
<li>アイテム
<ul class="org-ul">
<li>消耗品</li>
<li>売却アイテム</li>
<li>防具</li>
</ul></li>
<li>手札
<ul class="org-ul">
<li>アクションカード</li>
<li>サポートカード</li>
</ul></li>
</ul>

<p>
メモ。
</p>

<ul class="org-ul">
<li>なぜかInBackpackの条件で、結果に入らない
<ul class="org-ul">
<li>装備してるせいだった&#x2026;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1e500e4" class="outline-3">
<h3 id="org1e500e4"><a href="#org1e500e4"><span class="done CLOSE">CLOSE</span> アイテム以外でeffectをトリガーする方法</a></h3>
<div class="outline-text-3" id="text-org1e500e4">
<p>
今はまだ、アイテムトリガーしかない。AddItemで、コンポーネントに分解されてそれぞれEffectのキューに入り、実行される。
</p>

<p>
ただ、今後全回復とか、アイテム以外で何かしたいときが増える。そのときはどうするか。
</p>
</div>
</div>
<div id="outline-container-org0e0acef" class="outline-3">
<h3 id="org0e0acef"><a href="#org0e0acef"><span class="done DONE">DONE</span> メインメニューを開いているとCPU使用率が爆増する</a></h3>
<div class="outline-text-3" id="text-org0e0acef">
<p>
リークしている。
</p>

<ul class="org-ul">
<li>フィールド画面でも起こるな</li>
<li>ほかの画面では起こらない。どうもメニューの仕組みを使っているところで起きてそう</li>
</ul>

<div class="org-src-container">
<pre class="src src-shell">ps aux | head -n 1
</pre>
</div>

<pre class="example">
USER         PID %CPU %MEM    VSZ   RSS TTY      STAT START   TIME COMMAND
</pre>

<ul class="org-ul">
<li>ほかの画面でも、タブを切り替えたときなどに発生する。生成した画面を生成できてないんだろうな</li>
<li>RemoveChildren()で、表示されなくはなっているけど、それがガベージコレクションされてない</li>
<li>プロファイラの設定した</li>
<li>LoadFont()設定があると、残り続けるな。ないと、残らない</li>
<li>ずっとコンテナの親子関係に問題があると考えていた(RemoveChildrenまわり)けど、そうではなかった</li>
<li>Faceまわりを毎回初期化してたのを、リソース構造体に保存して、それを使うようにしたら解決した</li>
<li>なんだかよくわからないな</li>
<li>相変わらず微妙に増えてるように見えるが、freeされてるようにも見える</li>
</ul>
</div>
</div>
<div id="outline-container-org6857120" class="outline-3">
<h3 id="org6857120"><a href="#org6857120"><span class="done DONE">DONE</span> 画像回帰テスト</a></h3>
<div class="outline-text-3" id="text-org6857120">
<p>
コマンドで各ステートの画像を取れるようにする。
</p>
</div>
</div>
<div id="outline-container-orgbd88170" class="outline-3">
<h3 id="orgbd88170"><a href="#orgbd88170"><span class="done DONE">DONE</span> メモリリークをCIで検知したい</a></h3>
<div class="outline-text-3" id="text-orgbd88170">
<p>
まあパフォーマンスを画面表示してるし、わかるだろう。
</p>

<p>
一定期間起動して、一定になるか確かめるとよさそう。
</p>
</div>
</div>
<div id="outline-container-org9e27edf" class="outline-3">
<h3 id="org9e27edf"><a href="#org9e27edf"><span class="done DONE">DONE</span> ホーム画面をクリック対応する</a></h3>
<div class="outline-text-3" id="text-org9e27edf">
<p>
キーボードはとりあえずなくした。
</p>

<p>
今はキーボードでしか移動できない。
</p>

<p>
でもキーボード移動も残したい。
</p>
</div>
</div>
