20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.html
<div id="outline-container-orga631cfb" class="outline-3">
<h3 id="orga631cfb"><a href="#orga631cfb"><span class="done DONE">DONE</span> Ray Castingを参考にしてフィールドの原型を作る</a></h3>
<div class="outline-text-3" id="text-orga631cfb">
<ul class="org-ul">
<li>Ray Castingを原型に動くものを作る</li>
<li>やりたいことに近い。<a href="https://al-ro.github.io/projects/raycasting/">2D Ray Casting</a></li>
<li>ban-ban-donを参考にして各システムを実装する</li>
<li>特に目新しいことはなく、移動に関しては完全に参考にして作成できるように見える</li>
</ul>

<p>
ゲーム的。
</p>

<ul class="org-ul">
<li>動かしてみて、難易度的に難しい割に、そんなに移動にゲーム性生まれなくないかと感じた</li>
<li>不可視の範囲を作るのがそこまで面白いかと言われるとビミョー</li>
<li>ほかのサンプルでは興味深く見えた。距離をつけてないから、明るすぎるためか</li>
<li>シューティング要素はないからな。単なる追いかけっこが面白いかというと…ミンサガとかのイメージが近い。避けるためのスキルを使う</li>
<li>お宝探し感は楽しい</li>
<li>リアルタイムだと、シューティングの劣化版にしかならない。自分が動くと相手も動く形式であればよさそう。じっくり考えて駆け引きにする</li>
</ul>

<p>
実装。
</p>

<ul class="org-ul">
<li>三角形をグラデーションにすればよさそう</li>
<li>jsの方ではどうやってるか
<ul class="org-ul">
<li>単にfillをグラデーションで設定してるだけに見える</li>
</ul></li>
<li>画像
<ul class="org-ul">
<li>背景</li>
<li>影</li>
<li>三角</li>
</ul></li>
</ul>

<p>
ECSとの兼ね合い。
</p>

<ul class="org-ul">
<li>システムにしていきたいが、描画とかは厳しそうに見える。少なくとも1タイルごとに1エンティティとかにはできない</li>
<li>描画以外はECSにしていく</li>
<li>なんだか難しすぎるように見えるけど、どうなのだろう</li>
<li>たくさんの構造体をstateに書くのは違う。が、いじりたい状態フィールドがある</li>
</ul>
</div>
</div>
<div id="outline-container-org3bb5b7f" class="outline-3">
<h3 id="org3bb5b7f"><a href="#org3bb5b7f"><span class="done DONE">DONE</span> フィールドの背景を全体に設定する</a></h3>
<div class="outline-text-3" id="text-org3bb5b7f">
<p>
敷き詰めたい。
</p>

<ul class="org-ul">
<li>やっぱりVRTで失敗するな</li>
<li>手元で動かすと発生しないのはなぜなんだろうな</li>
</ul>
</div>
</div>
<div id="outline-container-orgcf2e5bc" class="outline-3">
<h3 id="orgcf2e5bc"><a href="#orgcf2e5bc"><span class="done DONE">DONE</span> コンポーネントを移動する</a></h3>
<div class="outline-text-3" id="text-orgcf2e5bc">
<p>
移動する。
</p>

<ul class="org-ul">
<li>メニューを透過できないな。真っ暗になる。fieldだとできるのはなぜだろう</li>
<li>スプライトを表示できない。何も表示されない
<ul class="org-ul">
<li>geoMで位置を指定してないせいだった</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4a066bf" class="outline-3">
<h3 id="org4a066bf"><a href="#org4a066bf"><span class="done DONE">DONE</span> 影描画をsystemでやる</a></h3>
<div class="outline-text-3" id="text-org4a066bf">
<p>
元の仕組みとは異なるため、調整が必要。
</p>

<ul class="org-ul">
<li>真っ黒になるな</li>
<li>レイも見えないので、間違ってるようだ</li>
<li>視点と同じ位置にあるために、全部真っ暗になっている説</li>
<li>外すと、いくつかのrayがおかしくなっていて失敗する
<ul class="org-ul">
<li>特定の点がおかしいようだ</li>
</ul></li>
<li>外周の壁がなくて、交点がないrayがあったせいだった</li>
</ul>
</div>
</div>
<div id="outline-container-org9a9054c" class="outline-3">
<h3 id="org9a9054c"><a href="#org9a9054c"><span class="done DONE">DONE</span> フィールド描画をECS化する</a></h3>
<div class="outline-text-3" id="text-org9a9054c">
<ul class="org-ul">
<li>まず影は置いておく</li>
<li>プレイヤー部分を色塗りできた</li>
<li>スプライトを表示するにはどうすればいいのだろう</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span><a href="https://github.com/kijimaD/ruins/blob/aa3088cfd9b52885ee6c5cd71cc7d2bed8495027/lib/loader/level.go#L358-L367">https://github.com/kijimaD/ruins/blob/aa3088cfd9b52885ee6c5cd71cc7d2bed8495027/lib/loader/level.go#L358-L367</a> ワープホールのsprite</label><pre class="src src-go">func createWarpNextEntity(componentList *loader.EntityComponentList, gameSpriteSheet *ec.SpriteSheet, line, col int) {
	componentList.Engine = append(componentList.Engine, loader.EngineComponentList{
		SpriteRender: &amp;ec.SpriteRender{SpriteSheet: gameSpriteSheet, SpriteNumber: warpNextSpriteNumber},
		Transform:    &amp;ec.Transform{},
	})
	componentList.Game = append(componentList.Game, GameComponentList{
		Warp:        &amp;gc.Warp{Mode: gc.WarpModeNext},
		GridElement: &amp;gc.GridElement{Line: line, Col: col},
	})
}
</pre>
</div>

<ul class="org-ul">
<li>スプライトシートは、起動時にtomlがロードされResourceの構造体に入れられる。ステート名をキーにして別々になっている
<ul class="org-ul">
<li>フィールドは &ldquo;field&rdquo; に、まとめて入っている</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgcfdf7c0" class="outline-3">
<h3 id="orgcfdf7c0"><a href="#orgcfdf7c0"><span class="done DONE">DONE</span> とりあえずの背景を設定する</a></h3>
<div class="outline-text-3" id="text-orgcfdf7c0">
<p>
Menuをなくしたとき、非表示にしてた。戻す。
</p>
</div>
</div>
<div id="outline-container-orgcfb24c3" class="outline-3">
<h3 id="orgcfb24c3"><a href="#orgcfb24c3"><span class="done DONE">DONE</span> 壁を通過できないようにする</a></h3>
<div class="outline-text-3" id="text-orgcfb24c3">
<ul class="org-ul">
<li>rectの中に入れないようにする。</li>
<li>線として持っておく必要はなくて、点4つだけを持っていればいい</li>
<li>ただそれだとステージの壁を自動生成しづらくなるのだが&#x2026;</li>
<li>範囲内のオブジェクトに対して衝突判定する</li>
<li>すべてのフィールド上オブジェクトは、中心のx, yをもつ。その中心と合わせてスプライトを配置し、4つの点を衝突判定に使う
<ul class="org-ul">
<li>この方式はキャラクターや敵、飾りオブジェクトには良いが、壁を配置するときには不適当だ。1点ではなくて、4点を指定したいだろう</li>
<li>ピクセル単位で配置できなくてもよくて、50ピクセルごととかでよさそう。こうするとテキストファイルでマップを作成できる。壁は50ピクセル正方形で囲って表現する</li>
<li>オブジェクト数が大変なことになりそうな懸念。視界をもつキャラごとにあるわけで。とはいえ、視界を限ればそんなでもなさそうな気も。オブジェクト数は多くなるが、そういうもんだろう。</li>
<li>2次元配列の問題に落とし込めることは重要に見える</li>
<li>壁は近傍8タイルで座標を変化させればいい。縦に並んでいれば横は細くするみたいな</li>
</ul></li>
</ul>

<pre class="example">
spawnWall(1, 1) // (1, 1)に壁を生成
spawnPlayer(2, 2)
spawnObject("岩", 20, 20)
spawnObject("花", 30, 30)
spawnWarp(40, 50)
</pre>

<pre class="example">
############
#          #
#          #
/          #
############
</pre>

<ul class="org-ul">
<li>現状のraycastの構造を、1点だけ保持するように修正しようとしているが、よくわからない</li>
<li>プレイヤーや壁の描画を先にやればよいのでは。影は一度忘れる</li>
</ul>
</div>
</div>
