20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.org
** DONE 壁テクスチャが影で隠れないようにする
CLOSED: [2024-05-06 Mon 10:02]
:PROPERTIES:
:Effort:   2:00
:END:
:LOGBOOK:
CLOCK: [2024-05-06 Mon 01:29]--[2024-05-06 Mon 01:54] =>  0:25
CLOCK: [2024-05-06 Mon 00:50]--[2024-05-06 Mon 01:15] =>  0:25
CLOCK: [2024-05-06 Mon 00:19]--[2024-05-06 Mon 00:44] =>  0:25
CLOCK: [2024-05-05 Sun 23:53]--[2024-05-06 Mon 00:18] =>  0:25
CLOCK: [2024-05-05 Sun 23:22]--[2024-05-05 Sun 23:47] =>  0:25
CLOCK: [2024-05-05 Sun 20:36]--[2024-05-05 Sun 21:01] =>  0:25
CLOCK: [2024-05-05 Sun 20:10]--[2024-05-05 Sun 20:35] =>  0:25
CLOCK: [2024-05-05 Sun 19:45]--[2024-05-05 Sun 20:10] =>  0:25
CLOCK: [2024-05-05 Sun 19:20]--[2024-05-05 Sun 19:45] =>  0:25
CLOCK: [2024-05-05 Sun 18:55]--[2024-05-05 Sun 19:20] =>  0:25
CLOCK: [2024-05-05 Sun 18:29]--[2024-05-05 Sun 18:54] =>  0:25
CLOCK: [2024-05-05 Sun 18:04]--[2024-05-05 Sun 18:29] =>  0:25
CLOCK: [2024-05-05 Sun 17:29]--[2024-05-05 Sun 17:54] =>  0:25
CLOCK: [2024-05-05 Sun 17:01]--[2024-05-05 Sun 17:26] =>  0:25
:END:
今は影に隠されている。影側で表示しようとすると、影の中にあるときもテクスチャが表示されてしまって微妙。

- 視界側でブレンドするとよさそう。いやでも、視界に入れば影になっていても見えてしまうのは同じか
- テクスチャ 影 ほかのテクスチャ 影
- テクスチャの描画優先度が距離によって変わればいいのかな。大変そうだ
- rayブレンド時に、スプライトも追加してやればいいかな
- ぐちゃぐちゃになったのでいったんもどす

#+caption: memo(できてない)
#+begin_src go
		// rayが命中しているかで、分岐させないといけない
		// raysのindex 2,3をrectに含んでいれば命中しているということになる
		world.Manager.Join(
			gameComponents.Position,
			gameComponents.SpriteRender,
			gameComponents.BlockView,
		).Visit(ecs.Visit(func(entity ecs.Entity) {
			oPos := gameComponents.Position.Get(entity).(*gc.Position)
			oSprite := gameComponents.SpriteRender.Get(entity).(*ec.SpriteRender)
			spriteWidth := oSprite.SpriteSheet.Sprites[oSprite.SpriteNumber].Width
			spriteHeight := oSprite.SpriteSheet.Sprites[oSprite.SpriteNumber].Height

			if !entity.HasComponent(gameComponents.Player) {
				x1 := float64(oPos.X - spriteWidth/2)
				x2 := float64(oPos.X + spriteWidth/2)
				y1 := float64(oPos.Y - spriteHeight/2)
				y2 := float64(oPos.Y + spriteHeight/2)
				for _, r := range rays {
					// x1 == r.X2
					if (x1 < r.X2 && x2 < r.X2) || (y1 < r.Y2 && y2 < r.Y2) {
						drawRect(shadowImage, blackImage, float32(oPos.X-16), float32(oPos.Y-16), 32, 32, opt)
					}

					// if x1 < r.X2 || x2 == r.X2 || y1 == r.Y2 || y2 == r.Y2 {
					// drawRect(shadowImage, blackImage, float32(oPos.X-16), float32(oPos.Y-16), 32, 32, opt)
					// }
				}
			}
		}))
#+end_src

- rayを飛ばして判定しているところで、エンティティにフラグを立てればよさそう
  - とすると、エンティティ単位でしか影を切り替えられなくなるな。ちょっと見えていてもテクスチャを全部表示するか、全部視界に入れないと表示しなくなる。微妙
- 近づいた影を消せばよさそう
** DONE 旧フィールドまわりを消す
CLOSED: [2024-05-06 Mon 15:46]
:LOGBOOK:
CLOCK: [2024-05-06 Mon 11:24]--[2024-05-06 Mon 11:49] =>  0:25
:END:

- componentsもいらないものがある
- prefabもいらなくなる
- levelまわりうつすのは、新しいものができてからでよさそう。参考になるからな
** DONE state名のフィールドという名前をリネームする
CLOSED: [2024-05-06 Mon 17:08]
:LOGBOOK:
CLOCK: [2024-05-06 Mon 15:46]--[2024-05-06 Mon 16:11] =>  0:25
CLOCK: [2024-05-06 Mon 12:05]--[2024-05-06 Mon 12:30] =>  0:25
:END:
構造体のフィールドとかと同じになるので、あまりよくない命名に思えてきた。dungeonとかだろうか。
** DONE カメラ移動を追加する
CLOSED: [2024-05-08 Wed 00:29]
:LOGBOOK:
CLOCK: [2024-05-08 Wed 00:04]--[2024-05-08 Wed 00:29] =>  0:25
CLOCK: [2024-05-07 Tue 23:39]--[2024-05-08 Wed 00:04] =>  0:25
CLOCK: [2024-05-06 Mon 23:59]--[2024-05-07 Tue 00:24] =>  0:25
CLOCK: [2024-05-06 Mon 22:45]--[2024-05-06 Mon 23:10] =>  0:25
CLOCK: [2024-05-06 Mon 22:12]--[2024-05-06 Mon 22:37] =>  0:25
CLOCK: [2024-05-06 Mon 20:37]--[2024-05-06 Mon 21:02] =>  0:25
CLOCK: [2024-05-06 Mon 20:12]--[2024-05-06 Mon 20:37] =>  0:25
CLOCK: [2024-05-06 Mon 19:38]--[2024-05-06 Mon 20:03] =>  0:25
CLOCK: [2024-05-06 Mon 19:17]--[2024-05-06 Mon 19:18] =>  0:01
:END:
後からやると大変そうなので今のうちにやっておく。

- 置物はgrid elementにしたほうが楽そうな感じがしてきた。いちいち座標で持っているのが扱いにくい。また別の問題は起きそうだが...
- グリッドの方が生成もしやすいしな
- でもグリッドだと、グリッドごとでしか配置できない。壁とかはそれでいいが、プレイヤーや敵はそうではない。描画で2つ必要になるのは微妙そうな
- カメラはコンポーネント化したほうがいいのだろうか。リソースでよさそうな感じもするが
  - 1つしかない想定なのでコンポーネント化はおおげさな感じ
  - 頻繁に変わる値だが、リソースだと不適当な感じ
  - Playerと同一でよさそうな。いやでも今たまたま同じというだけで、効果によっては変えたいこともありそう。カメラを自分以外に動かしたいこともあるだろ。分けたほうがよさそう
  - ズーム率とかも持ちたいから、そこは別にしたい
- cameraはutilsでなくresourcesにあるべきなのでは
** DONE ズームを追加する
CLOSED: [2024-05-08 Wed 18:09]
:PROPERTIES:
:Effort:   1:00
:END:
:LOGBOOK:
CLOCK: [2024-05-08 Wed 00:29]--[2024-05-08 Wed 00:54] =>  0:25
:END:
追加する。
** DONE 方向を追加する
CLOSED: [2024-05-09 Thu 00:36]
:LOGBOOK:
CLOCK: [2024-05-08 Wed 23:01]--[2024-05-08 Wed 23:26] =>  0:25
CLOCK: [2024-05-08 Wed 22:30]--[2024-05-08 Wed 22:55] =>  0:25
CLOCK: [2024-05-08 Wed 21:39]--[2024-05-08 Wed 22:04] =>  0:25
CLOCK: [2024-05-08 Wed 21:06]--[2024-05-08 Wed 21:31] =>  0:25
CLOCK: [2024-05-08 Wed 20:19]--[2024-05-08 Wed 20:44] =>  0:25
CLOCK: [2024-05-08 Wed 18:09]--[2024-05-08 Wed 18:34] =>  0:25
:END:

追加する。

- 方向による回転描画
- 方向転換
** DONE 描画の優先順を指定できるようにする
CLOSED: [2024-05-11 Sat 17:43]
:LOGBOOK:
CLOCK: [2024-05-11 Sat 17:11]--[2024-05-11 Sat 17:36] =>  0:25
CLOCK: [2024-05-11 Sat 16:46]--[2024-05-11 Sat 17:11] =>  0:25
CLOCK: [2024-05-09 Thu 00:37]--[2024-05-09 Thu 01:02] =>  0:25
CLOCK: [2024-05-06 Mon 10:32]--[2024-05-06 Mon 10:57] =>  0:25
:END:
ワープパッドとキャラでは、キャラを上に表示する。

- キャラクター
  - キャラクター同士は重ならない
- ワープパッド
  - 同士は重ならない
- フィールドのアイテム
  - 同士は重ならない
- これは、SpriteRenderに設定してよさそうか。タイルの種別ごとに設定できれば問題ないよな
- SpriteRenderはengineにあるので、移動させてからいじるか...
- Positionに置くのもよさそう。描画の優先順位なので、単なる描画に使う要素なのだが、まあいいのかな
- depthはあまり種類は多くない。重なる組み合わせは少ない
** DONE フィードバックをもらうためにどうするか
CLOSED: [2024-05-11 Sat 17:43]
いったん最低限で完成させて、フィードバックをもらうのを優先する。
** DONE 視界範囲外を描画しない
CLOSED: [2024-05-16 Thu 21:30]

カメラ外も描画して重くなっている。と考えて描画しないようにしたら、逆に重くなった。キャッシュされているのだろうか。まだ別に必要ではなさそうなので、必要なときにやる。
** DONE 階層を追加する
CLOSED: [2024-05-16 Thu 01:01]
:LOGBOOK:
CLOCK: [2024-05-16 Thu 00:43]--[2024-05-16 Thu 01:01] =>  0:18
CLOCK: [2024-05-15 Wed 22:38]--[2024-05-15 Wed 23:03] =>  0:25
CLOCK: [2024-05-12 Sun 10:23]--[2024-05-12 Sun 10:48] =>  0:25
CLOCK: [2024-05-12 Sun 09:47]--[2024-05-12 Sun 10:12] =>  0:25
CLOCK: [2024-05-11 Sat 23:06]--[2024-05-11 Sat 23:31] =>  0:25
CLOCK: [2024-05-11 Sat 22:36]--[2024-05-11 Sat 23:01] =>  0:25
CLOCK: [2024-05-11 Sat 22:08]--[2024-05-11 Sat 22:33] =>  0:25
CLOCK: [2024-05-06 Mon 17:53]--[2024-05-06 Mon 18:18] =>  0:25
CLOCK: [2024-05-06 Mon 17:09]--[2024-05-06 Mon 17:34] =>  0:25
:END:
ステージの初期化と、階層移動できるようにする。

- 現状はフロアの概念がない。ステートに入ったときに1フロア分初期化してるだけ
- https://ebitengine.org/ja/examples/isometric.html が参考になりそう
- 階を移動するごとにフロアを生成する
- 今の仕組みだと、オブジェクトが莫大な数になる
  - 影描画はしなくてよさそう
  - 見えてる部分のオブジェクトとタイルにフラグをもたせて、そこだけ表示すればいい
  - 衝突判定が多いのは同じなのでは
  - 衝突判定範囲を限れば、そう問題にはならないか
- マップ構造物がオブジェクトだと、マップ生成がしにくい
- 絵の描画と、座標がどのタイルにあたるかがわかればいい。わざわざオブジェクトにしなくてもいい
- 視界の衝突判定はどうするか
  - diggerではfield_of_viewという便利関数があった
- 壁はオブジェクトではなく、タイルにする。変わることはないのと、数が多くて大変だから
  - タイルも、見えてる部分しか描画しない
- 現状は、見える部分をすべてポリゴンで表示する必要がある。このポリゴンを作るために、周囲を囲ってrayが命中しなければならない

#+begin_src
##############
###        @ #
###o ##      #
##############
#+end_src
** DONE タイル位置と座標位置の変換が煩雑
CLOSED: [2024-05-16 Thu 21:29]
:LOGBOOK:
CLOCK: [2024-05-16 Thu 21:01]--[2024-05-16 Thu 21:26] =>  0:25
CLOCK: [2024-05-16 Thu 20:13]--[2024-05-16 Thu 20:38] =>  0:25
CLOCK: [2024-05-16 Thu 19:48]--[2024-05-16 Thu 20:13] =>  0:25
CLOCK: [2024-05-16 Thu 19:22]--[2024-05-16 Thu 19:47] =>  0:25
CLOCK: [2024-05-16 Thu 18:51]--[2024-05-16 Thu 19:16] =>  0:25
:END:
これが全部コンポーネントであれば楽なのだが。まあ、タイルだと衝突判定とかは楽になるから...。

- タイルコンポーネントにするのはありか
- タイルに沿わせたいものと、そうでないものがある
- 壁とかワープホールはタイルに沿わせたい
- 移動体はタイルに沿わせたくない
- 配置方法は共通化したい
- 衝突判定は別でよさそう。タイルに沿わないのは計算が多く必要で、タイルに沿うのは計算が簡単
- resources と GridElement の使い分けがわからない。どちらもタイルを保持しているように見える
  - resourcesのほうはタイルの幅と高さか
** DONE levelを消す
CLOSED: [2024-05-16 Thu 21:31]
普通のgameComponent(engineではないほう)でlevelを実装してから、消す感じでいいか。参考になりそうだから消してない。
** DONE レイキャスト範囲を狭くする
CLOSED: [2024-05-16 Thu 21:32]
今後オブジェクトを増やすたびに重くなるので。

ある程度狭い範囲に、範囲を制限する矩形を置くようにした。

- NPCを追加したときに、競合しないか。つまりほかの視界をもつオブジェクトとの兼ね合いをどうするかの問題はある
  - それぞれのエンティティごとに競合しない形であれば、よさそうか
