20231128T074518--kdoc-59-ecsを使ってサンプルゲームを作る__project.html
<div id="outline-container-orgc46d5a1" class="outline-3">
<h3 id="orgc46d5a1"><a href="#orgc46d5a1"><span class="done DONE">DONE</span> 壁テクスチャが影で隠れないようにする</a></h3>
<div class="outline-text-3" id="text-orgc46d5a1">
<p>
今は影に隠されている。影側で表示しようとすると、影の中にあるときもテクスチャが表示されてしまって微妙。
</p>

<ul class="org-ul">
<li>視界側でブレンドするとよさそう。いやでも、視界に入れば影になっていても見えてしまうのは同じか</li>
<li>テクスチャ 影 ほかのテクスチャ 影</li>
<li>テクスチャの描画優先度が距離によって変わればいいのかな。大変そうだ</li>
<li>rayブレンド時に、スプライトも追加してやればいいかな</li>
<li>ぐちゃぐちゃになったのでいったんもどす</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>memo(できてない)</label><pre class="src src-go">// rayが命中しているかで、分岐させないといけない
// raysのindex 2,3をrectに含んでいれば命中しているということになる
world.Manager.Join(
	gameComponents.Position,
	gameComponents.SpriteRender,
	gameComponents.BlockView,
).Visit(ecs.Visit(func(entity ecs.Entity) {
	oPos := gameComponents.Position.Get(entity).(*gc.Position)
	oSprite := gameComponents.SpriteRender.Get(entity).(*ec.SpriteRender)
	spriteWidth := oSprite.SpriteSheet.Sprites[oSprite.SpriteNumber].Width
	spriteHeight := oSprite.SpriteSheet.Sprites[oSprite.SpriteNumber].Height

	if !entity.HasComponent(gameComponents.Player) {
		x1 := float64(oPos.X - spriteWidth/2)
		x2 := float64(oPos.X + spriteWidth/2)
		y1 := float64(oPos.Y - spriteHeight/2)
		y2 := float64(oPos.Y + spriteHeight/2)
		for _, r := range rays {
			// x1 == r.X2
			if (x1 &lt; r.X2 &amp;&amp; x2 &lt; r.X2) || (y1 &lt; r.Y2 &amp;&amp; y2 &lt; r.Y2) {
				drawRect(shadowImage, blackImage, float32(oPos.X-16), float32(oPos.Y-16), 32, 32, opt)
			}

			// if x1 &lt; r.X2 || x2 == r.X2 || y1 == r.Y2 || y2 == r.Y2 {
			// drawRect(shadowImage, blackImage, float32(oPos.X-16), float32(oPos.Y-16), 32, 32, opt)
			// }
		}
	}
}))
</pre>
</div>

<ul class="org-ul">
<li>rayを飛ばして判定しているところで、エンティティにフラグを立てればよさそう
<ul class="org-ul">
<li>とすると、エンティティ単位でしか影を切り替えられなくなるな。ちょっと見えていてもテクスチャを全部表示するか、全部視界に入れないと表示しなくなる。微妙</li>
</ul></li>
<li>近づいた影を消せばよさそう</li>
</ul>
</div>
</div>
<div id="outline-container-orgbe7278b" class="outline-3">
<h3 id="orgbe7278b"><a href="#orgbe7278b"><span class="done DONE">DONE</span> 旧フィールドまわりを消す</a></h3>
<div class="outline-text-3" id="text-orgbe7278b">
<ul class="org-ul">
<li>componentsもいらないものがある</li>
<li>prefabもいらなくなる</li>
<li>levelまわりうつすのは、新しいものができてからでよさそう。参考になるからな</li>
</ul>
</div>
</div>
<div id="outline-container-org7623cb9" class="outline-3">
<h3 id="org7623cb9"><a href="#org7623cb9"><span class="done DONE">DONE</span> state名のフィールドという名前をリネームする</a></h3>
<div class="outline-text-3" id="text-org7623cb9">
<p>
構造体のフィールドとかと同じになるので、あまりよくない命名に思えてきた。dungeonとかだろうか。
</p>
</div>
</div>
<div id="outline-container-orga6f7d72" class="outline-3">
<h3 id="orga6f7d72"><a href="#orga6f7d72"><span class="done DONE">DONE</span> カメラ移動を追加する</a></h3>
<div class="outline-text-3" id="text-orga6f7d72">
<p>
後からやると大変そうなので今のうちにやっておく。
</p>

<ul class="org-ul">
<li>置物はgrid elementにしたほうが楽そうな感じがしてきた。いちいち座標で持っているのが扱いにくい。また別の問題は起きそうだが&#x2026;</li>
<li>グリッドの方が生成もしやすいしな</li>
<li>でもグリッドだと、グリッドごとでしか配置できない。壁とかはそれでいいが、プレイヤーや敵はそうではない。描画で2つ必要になるのは微妙そうな</li>
<li>カメラはコンポーネント化したほうがいいのだろうか。リソースでよさそうな感じもするが
<ul class="org-ul">
<li>1つしかない想定なのでコンポーネント化はおおげさな感じ</li>
<li>頻繁に変わる値だが、リソースだと不適当な感じ</li>
<li>Playerと同一でよさそうな。いやでも今たまたま同じというだけで、効果によっては変えたいこともありそう。カメラを自分以外に動かしたいこともあるだろ。分けたほうがよさそう</li>
<li>ズーム率とかも持ちたいから、そこは別にしたい</li>
</ul></li>
<li>cameraはutilsでなくresourcesにあるべきなのでは</li>
</ul>
</div>
</div>
<div id="outline-container-orgaa5eec9" class="outline-3">
<h3 id="orgaa5eec9"><a href="#orgaa5eec9"><span class="done DONE">DONE</span> ズームを追加する</a></h3>
<div class="outline-text-3" id="text-orgaa5eec9">
<p>
追加する。
</p>
</div>
</div>
<div id="outline-container-orgc9c2925" class="outline-3">
<h3 id="orgc9c2925"><a href="#orgc9c2925"><span class="done DONE">DONE</span> 方向を追加する</a></h3>
<div class="outline-text-3" id="text-orgc9c2925">
<p>
追加する。
</p>

<ul class="org-ul">
<li>方向による回転描画</li>
<li>方向転換</li>
</ul>
</div>
</div>
<div id="outline-container-org237a6de" class="outline-3">
<h3 id="org237a6de"><a href="#org237a6de"><span class="done DONE">DONE</span> 描画の優先順を指定できるようにする</a></h3>
<div class="outline-text-3" id="text-org237a6de">
<p>
ワープパッドとキャラでは、キャラを上に表示する。
</p>

<ul class="org-ul">
<li>キャラクター
<ul class="org-ul">
<li>キャラクター同士は重ならない</li>
</ul></li>
<li>ワープパッド
<ul class="org-ul">
<li>同士は重ならない</li>
</ul></li>
<li>フィールドのアイテム
<ul class="org-ul">
<li>同士は重ならない</li>
</ul></li>
<li>これは、SpriteRenderに設定してよさそうか。タイルの種別ごとに設定できれば問題ないよな</li>
<li>SpriteRenderはengineにあるので、移動させてからいじるか&#x2026;</li>
<li>Positionに置くのもよさそう。描画の優先順位なので、単なる描画に使う要素なのだが、まあいいのかな</li>
<li>depthはあまり種類は多くない。重なる組み合わせは少ない</li>
</ul>
</div>
</div>
<div id="outline-container-org17eb055" class="outline-3">
<h3 id="org17eb055"><a href="#org17eb055"><span class="done DONE">DONE</span> フィードバックをもらうためにどうするか</a></h3>
<div class="outline-text-3" id="text-org17eb055">
<p>
いったん最低限で完成させて、フィードバックをもらうのを優先する。
</p>
</div>
</div>
<div id="outline-container-org67084d9" class="outline-3">
<h3 id="org67084d9"><a href="#org67084d9"><span class="done DONE">DONE</span> 視界範囲外を描画しない</a></h3>
<div class="outline-text-3" id="text-org67084d9">
<p>
カメラ外も描画して重くなっている。と考えて描画しないようにしたら、逆に重くなった。キャッシュされているのだろうか。まだ別に必要ではなさそうなので、必要なときにやる。
</p>
</div>
</div>
<div id="outline-container-org0aa305a" class="outline-3">
<h3 id="org0aa305a"><a href="#org0aa305a"><span class="done DONE">DONE</span> 階層を追加する</a></h3>
<div class="outline-text-3" id="text-org0aa305a">
<p>
ステージの初期化と、階層移動できるようにする。
</p>

<ul class="org-ul">
<li>現状はフロアの概念がない。ステートに入ったときに1フロア分初期化してるだけ</li>
<li><a href="https://ebitengine.org/ja/examples/isometric.html">https://ebitengine.org/ja/examples/isometric.html</a> が参考になりそう</li>
<li>階を移動するごとにフロアを生成する</li>
<li>今の仕組みだと、オブジェクトが莫大な数になる
<ul class="org-ul">
<li>影描画はしなくてよさそう</li>
<li>見えてる部分のオブジェクトとタイルにフラグをもたせて、そこだけ表示すればいい</li>
<li>衝突判定が多いのは同じなのでは</li>
<li>衝突判定範囲を限れば、そう問題にはならないか</li>
</ul></li>
<li>マップ構造物がオブジェクトだと、マップ生成がしにくい</li>
<li>絵の描画と、座標がどのタイルにあたるかがわかればいい。わざわざオブジェクトにしなくてもいい</li>
<li>視界の衝突判定はどうするか
<ul class="org-ul">
<li>diggerではfield_of_viewという便利関数があった</li>
</ul></li>
<li>壁はオブジェクトではなく、タイルにする。変わることはないのと、数が多くて大変だから
<ul class="org-ul">
<li>タイルも、見えてる部分しか描画しない</li>
</ul></li>
<li>現状は、見える部分をすべてポリゴンで表示する必要がある。このポリゴンを作るために、周囲を囲ってrayが命中しなければならない</li>
</ul>

<pre class="example">
##############
###        @ #
###o ##      #
##############
</pre>
</div>
</div>
<div id="outline-container-org74da6f5" class="outline-3">
<h3 id="org74da6f5"><a href="#org74da6f5"><span class="done DONE">DONE</span> タイル位置と座標位置の変換が煩雑</a></h3>
<div class="outline-text-3" id="text-org74da6f5">
<p>
これが全部コンポーネントであれば楽なのだが。まあ、タイルだと衝突判定とかは楽になるから&#x2026;。
</p>

<ul class="org-ul">
<li>タイルコンポーネントにするのはありか</li>
<li>タイルに沿わせたいものと、そうでないものがある</li>
<li>壁とかワープホールはタイルに沿わせたい</li>
<li>移動体はタイルに沿わせたくない</li>
<li>配置方法は共通化したい</li>
<li>衝突判定は別でよさそう。タイルに沿わないのは計算が多く必要で、タイルに沿うのは計算が簡単</li>
<li>resources と GridElement の使い分けがわからない。どちらもタイルを保持しているように見える
<ul class="org-ul">
<li>resourcesのほうはタイルの幅と高さか</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgab6400d" class="outline-3">
<h3 id="orgab6400d"><a href="#orgab6400d"><span class="done DONE">DONE</span> levelを消す</a></h3>
<div class="outline-text-3" id="text-orgab6400d">
<p>
普通のgameComponent(engineではないほう)でlevelを実装してから、消す感じでいいか。参考になりそうだから消してない。
</p>
</div>
</div>
<div id="outline-container-org0db9392" class="outline-3">
<h3 id="org0db9392"><a href="#org0db9392"><span class="done DONE">DONE</span> レイキャスト範囲を狭くする</a></h3>
<div class="outline-text-3" id="text-org0db9392">
<p>
今後オブジェクトを増やすたびに重くなるので。
</p>

<p>
ある程度狭い範囲に、範囲を制限する矩形を置くようにした。
</p>

<ul class="org-ul">
<li>NPCを追加したときに、競合しないか。つまりほかの視界をもつオブジェクトとの兼ね合いをどうするかの問題はある
<ul class="org-ul">
<li>それぞれのエンティティごとに競合しない形であれば、よさそうか</li>
</ul></li>
</ul>
</div>
</div>
